{"Aaron Sloman": "- Aaron Sloman is a philosopher and researcher on artificial intelligence and cognitive science\n- He held the Chair in Artificial Intelligence and Cognitive Science at the School of Computer Science at the University of Birmingham and previously at the University of Sussex\n- Sloman has published widely on philosophy of mathematics, epistemology, cognitive science, and artificial intelligence and collaborated with biologist Jackie Chappell on the evolution of intelligence\n- He was born in Southern Rhodesia (now Zimbabwe) to Lithuanian Jewish parents, and went to school in Cape Town before earning a degree in Mathematics and Physics at the University of Cape Town and a DPhil in philosophy at the University of Oxford\n- Sloman's philosophical ideas were influenced by Immanuel Kant, Gottlob Frege, Karl Popper and others, and his work in AI by Marvin Minsky and John McCarthy\n- He is a Fellow of several AI and philosophy associations and received the K. Jon Barwise Prize for contributions to philosophy and computing from the American Philosophical Association in 2020\n- Sloman has published numerous papers and presentations, including The Computer Revolution in Philosophy, which emphasized the importance of architectures in AI and philosophy", "Abhay Bhushan": "\n\n- Abhay Bhushan Pandey is an Indian computer scientist.\n- He made significant contributions to the development of the Internet TCP/IP architecture.\n- He is the author of the File Transfer Protocol and early versions of email protocols.\n- He graduated from the first batch of Indian Institute of Technology Kanpur in 1965 with a B.Tech in electrical engineering.\n- He received a Masters in electrical engineering and a degree in Management from the MIT Sloan School of Management.\n- He worked on developing FTP and email protocols for ARPANet and subsequent Internet.\n- He was a Director at the Institute of Engineering and Rural Technology in Allahabad and a senior manager in Engineering and Development of Xerox.\n- He was a co-founder of YieldUP International and Portola Communications.\n- He is currently chairman of Asquare Inc., Secretary of Indians for Collective Action and former President of the IIT-Kanpur Foundation.", "Adam Dunkels": "- Adam Dunkels is a Swedish computer scientist and entrepreneur\n- He is the founder of Thingsquare, an Internet of things product development business\n- Dunkels focuses on computer networking technology and distributed communication for small embedded systems and devices\n- He attended the Swedish Institute of Computer Science, earning a B.S., M.S., and Ph.D.\n- Dunkels is known for his work on the uIP and lwIP TCP/IP Internet protocol suite and for inventing protothreads and the operating system Contiki\n- He co-authored the book Interconnecting Smart Objects with IP: the Next Internet and founded the Internet Protocol for Smart Objects Alliance\n- Dunkels has received various awards for his work, including the TR35 list of top innovators under 35 and the ACM SIGOPS EuroSys Roger Needham PhD award\n- His small implementations have been used in commercial products by companies such as ABB, Cisco Systems, and Volvo Technology\n- Some of his notable implementations include Protothreads, uIP, Contiki, and lwIP.", "Adele Goldberg (computer scientist)": "- Adele Goldberg is an American computer scientist, born July 22, 1945 in Cleveland, Ohio.\n- She co-developed the programming language Smalltalk-80 and various concepts related to object-oriented programming at Xerox Palo Alto Research Center (PARC) in the 1970s.\n- Goldberg earned a bachelor's degree in mathematics at the University of Michigan in 1967, and a master's (1969) and PhD (1973) in information science at the University of Chicago, where she completed her dissertation while working at Stanford University.\n- Goldberg served as manager of the System Concepts Laboratory at PARC, where she developed Smalltalk-80 with Alan Kay and other researchers, introducing a programming environment of overlapping windows on graphic display screens.\n- Many of Goldberg's concepts became the basis for graphical user interfaces, and Steve Jobs demanded a demonstration of the Smalltalk System before incorporating ideas into Apple's Macintosh environment.\n- Goldberg left PARC in 1988 to cofound ParcPlace Systems, a company that created development tools for Smalltalk-based applications, and cofounded Neometron, Inc. in 1999, an Internet support provider.\n- Goldberg has received numerous awards and honors, including the ACM Software Systems Award in 1987 and admission to the Women in Technology International Hall of Fame in 2010.\n- The Computer History Museum has a collection of Goldberg's working documents, reports, publications, and videos related to her work on Smalltalk.\n- Goldberg's publications include books on Smalltalk-80: The Language and Its Implementation (1983), The Interactive Programming Environment (1983), and The Language (1989).", "Adi Shamir": "\n\n- Adi Shamir is an Israeli cryptographer.\n- He co-invented the RSA algorithm with Ron Rivest and Len Adleman.\n- He is also a co-inventor of the Feige-Fiat-Shamir identification scheme with Uriel Feige and Amos Fiat.\n- He has made contributions to the field of cryptography and computer science, including the discovery of differential cryptanalysis.\n- He received a BSc in mathematics from Tel Aviv University and an MSc and PhD in Computer Science from the Weizmann Institute.\n- He has received numerous awards and honors, including the ACM Turing Award, the Paris Kanellakis Theory and Practice Award, and the Japan Prize in the field of Electronics, Information and Communication.\n- He was elected a Foreign Member of the Royal Society (ForMemRS) and a Member of the American Philosophical Society.", "Adriaan van Wijngaarden": "\n\n- Adriaan \"Aad\" van Wijngaarden was a Dutch mathematician and computer scientist who promoted the mathematical aspects of computing.\n- He received a degree in mechanical engineering from Delft University of Technology in 1939.\n- Van Wijngaarden became head of the Computing Department of the Mathematisch Centrum (MC) in Amsterdam in 1947.\n- He worked on the construction of the first Dutch computer, the ARRA, in 1952.\n- Van Wijngaarden was one of the designers of the original ALGOL language and later ALGOL 68.\n- He developed a two-level type of formal grammar known as a Van Wijngaarden grammar.\n- In 1962, he became a member of the International Federation for Information Processing (IFIP) IFIP Working Group 2.1 on Algorithmic Languages and Calculi.\n- The Van Wijngaarden Awards are named in his honor and are awarded every 5 years from the 60th anniversary of the Centrum Wiskunde & Informatica in 2006.\n- Four individuals have been awarded the Van Wijngaarden Awards so far: Nancy Lynch, Persi Diaconis, Éva Tardos, John C. Butcher, Xavier Leroy, Sara van de Geer, Marta Kwiatkowska, and Susan Murphy.\n- Van Wijngaarden died on February 7, 1987.", "Alan Dix": "\n\n- Alan John Dix is a British author, researcher, and university professor specializing in human-computer interaction (HCI).\n- He is one of the four co-authors of the university-level textbook Human-Computer Interaction.\n- Dix is the Director of the Computational Foundry at Swansea University since May 2018.\n- He was previously a professor at Lancaster University.\n- Dix has authored several books, including Human-Computer Interaction (1st, 2nd, and 3rd editions) and Formal Methods for Interactive Systems.\n- He has also contributed to the book People and Computers III with a chapter titled \"Myth of the Infinitely Fast Machine.\"\n- Additionally, Dix has a personal website and has been a part of the International Mathematical Olympiad.", "Alan Edelman": "\n\n- Alan Stuart Edelman is a mathematician and computer scientist.\n- He is a professor of applied mathematics at MIT and a Principal Investigator at the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL).\n- In 2004, he founded Interactive Supercomputing which was later acquired by Microsoft.\n- Edelman is a fellow of various prestigious societies and academies in the field such as American Mathematical Society, Society for Industrial and Applied Mathematics, Institute of Electrical and Electronics Engineers, and Association for Computing Machinery.\n- His research interests include high-performance computing, numerical computation, linear algebra, and random matrix theory.\n- Edelman is known for his contributions to the Julia programming language, parallel computing, and the Future Fast Fourier transform.\n- He has received numerous awards for his research including the Gordon Bell Prize, Chauvenet Prize, and Lester R. Ford Award, among others.\n- He became a Fellow of SIAM in 2011, the American Mathematical Society in 2015, an IEEE Fellow Class in 2018, and an ACM Fellow of Class 2020.\n- Edelman’s contributions to random matrix theory and numerical linear algebra are notable.", "Alan Kay": "- Alan Curtis Kay is an American computer scientist.\n- He is known for his pioneering work on object-oriented programming and windowing graphical user interface design.\n- He led the design and development of the first modern windowed computer desktop interface at Xerox PARC.\n- He also led the development of the influential object-oriented programming language Smalltalk.\n- He has been elected a Fellow of the American Academy of Arts and Sciences, the National Academy of Engineering, and the Royal Society of Arts.\n- He received the Turing award in 2003.\n- Kay is a former professional jazz guitarist, composer, and theatrical designer.\n- He is also an amateur classical pipe organist.\n- Kay attended the University of Utah College of Engineering and worked with David C. Evans and Ivan Sutherland.\n- He joined the Xerox PARC research staff in Palo Alto, California in 1970.\n- Kay conceived the Dynabook concept, a key progenitor of laptop and tablet computers and the e-book.\n- He has worked as Chief Scientist at Atari and an Apple Fellow.\n- Kay founded the Viewpoints Research Institute in 2001, a nonprofit organization dedicated to children, learning, and advanced software development.\n- He collaborated with others to start the open source Squeak version of Smalltalk.\n- Kay has lectured extensively on the idea that the computer revolution is very new, and all of the good ideas have not been universally implemented.\n- He has received many awards and honors, including the ACM Turing Award and honorary doctorates from several universities.", "Alan Mycroft": "\n\n- Alan Mycroft is a professor at the Computer Laboratory, University of Cambridge.\n- He is a Fellow of Robinson College, Cambridge, and the director of studies for computer science.\n- Mycroft completed his PhD in Edinburgh with a thesis on Abstract interpretation and optimising transformations for applicative programs.\n- His research interests are in programming languages, software engineering, and algorithms.\n- Mycroft co-created the Norcroft C compiler with Arthur Norman.\n- He is also a named trustee of the Raspberry Pi Foundation, a charitable organization that promotes basic computer science education.\n- Mycroft has four children.", "Alan Perlis": "\n\n- Alan Jay Perlis was an American computer scientist and professor at Purdue University, Carnegie Mellon University, and Yale University.\n- He was born in Pittsburgh in 1922 and received his bachelor's degree in chemistry from Carnegie Institute of Technology in 1943.\n- He earned a master's and Ph.D. in mathematics at MIT and wrote his dissertation on \"Integral Equations, Their Solution by Iteration and Analytic Continuation.\"\n- Perlis participated in Project Whirlwind in 1952 and was eventually appointed the first head of the computer science department at Carnegie Mellon University.\n- In 1962, he was elected president of the Association for Computing Machinery and won the first Turing Award in 1966 for his work on the programming language ALGOL and Internal Translator.\n- Perlis moved to Yale University in 1971 to take the chair of computer science and was elected to the National Academy of Engineering in 1977.\n- He wrote an article, \"Epigrams on Programming,\" in 1982, distilling his programming wisdom into one-sentence quotes.\n- He passed away in 1990 and left behind a notable list of publications, including \"An Introductory Course in Computer Programming\" and \"In Praise of APL: A Language for Lyrical Programming.\"", "Alberto Ciaramella": "- Alberto Ciaramella is an Italian computer engineer and scientist.\n- He obtained a Laurea in Electronic Engineering and the Post-Laurea in 1969 at La Sapienza University in Rome.\n- Ciaramella is notable for extensive pioneering contributions in the field of speech technologies and applied natural language processing.\n- He has published 40 papers and holds four patents.\n- Ciaramella worked at CSELT as a research engineer and co-authored some of the first international patents for speech recognition and speaker recognition.\n- He co-founded IntelliSemantic and continues research in applied language technologies.\n- In 2010 he co-authored a paper about the application of emerging \"semantic\" technologies to patent analysis.\n- Ciaramella participated in European projects focused on speech recognition and dialogue systems on many European languages, such as Italian.", "Alexander Dewdney": "- Alexander Keewatin Dewdney is a Canadian mathematician, computer scientist, author, filmmaker, and conspiracy theorist. \n- He was born in London, Ontario and is the son of Canadian artist and author Selwyn Dewdney.\n- He has made a number of experimental films including Malanga, Four Girls, Scissors, and the Maltese Cross Movement. He has also written two novels: The Planiverse and Hungry Hollow: The Story of a Natural Place.\n- Dewdney has written a number of books on mathematics, computing, and bad science and founded and edited a magazine on recreational programming called Algorithm. \n- He was a co-inventor of programming game Core War and has worked on biology as a field ecologist and mathematical biologist. \n- Dewdney is a member of the 9/11 truth movement and has theorized that the planes used in the September 11 attacks were flown by remote control.\n- He has published over 10 books on scientific possibilities and puzzles.", "Alexander Stepanov": "- Alexander Alexandrovich Stepanov is a Russian-American computer programmer.\n- He is an advocate of generic programming and is best known as the primary designer and implementer of the C++ Standard Template Library.\n- He started to develop the C++ Standard Template Library in 1992 while employed at HP Labs.\n- He convinced his colleagues at General Electric Research and Development to pursue generic programming and developed an Ada library for list processing in 1987.\n- He recognized that C++ was more likely to become widely used and provide good support for generic programming, leading to the development of the C++ Standard Template Library.\n- He is also the author of two books, Elements of Programming (with Paul McJones) and From Mathematics to Generic Programming (with Daniel E. Rose).\n- He retired from A9.com in January 2016.", "Alfred Aho": "\n\n- Alfred Vaino Aho is a Canadian computer scientist.\n- He is best known for his work on programming languages, compilers, and related algorithms, and his textbooks on the art and science of computer programming.\n- Aho was elected into the National Academy of Engineering in 1999 for his contributions to the fields of algorithms and programming tools.\n- He and his long-time collaborator Jeffrey Ullman are the recipients of the 2020 Turing Award, generally recognized as the highest distinction in computer science.\n- He received a B.A.Sc., M.A., and Ph.D. in Engineering Physics, Electrical Engineering/Computer Science from the University of Toronto and Princeton University.\n- Aho conducted research at Bell Labs from 1967 to 1991, and again from 1997 to 2002 as Vice President of the Computing Sciences Research Center.\n- Since 1995, he has held the Lawrence Gussman Professorship in Computer Science at Columbia University, where he has also served as the department chair.\n- Aho is widely known for his co-authorship of the AWK programming language with Peter J. Weinberger and Brian Kernighan.\n- He has authored or co-authored many textbooks, including the famous \"dragon books\" on compiler design.\n- Aho has received many prestigious honors, including the IEEE's John von Neumann Medal and membership in the National Academy of Engineering.", "Alston Householder": "- Alston Scott Householder is an American mathematician.\n- He specialized in mathematical biology and numerical analysis.\n- He invented the Householder transformation and Householder's method.\n- Householder received a PhD from the University of Chicago in 1937 for his thesis on the calculus of variations.\n- He worked on mathematical biology with Nicolas Rashevsky at the University of Chicago, then shifted to numerical analysis while at Oak Ridge National Laboratory.\n- Householder contributed to the organisation of research, serving as president of the Society for Industrial and Applied Mathematics.\n- He was married twice and had two children.\n- Some of his selected works include \"Discussion of a set of points in terms of their mutual distances\", a pioneer paper in multidimensional scaling, and \"The theory of matrices in numerical analysis\".\n- Householder died in Malibu, California in 1993.", "Amir Pnueli": "\n\n- Amir Pnueli was an Israeli computer scientist\n- He received a Bachelor's degree in mathematics from the Technion and a Ph.D. in applied mathematics from the Weizmann Institute of Science\n- He is known for his work in temporal logic and model checking\n- He founded and was the first chair of the computer science department at Tel Aviv University\n- He received the Turing Award in 1996 for his contributions to program and systems verification\n- He also founded two startup technology companies during his career\n- He died on November 2, 2009, of a brain hemorrhage\n- He received several awards and honors, including the Israel Prize for computer science in 2000\n- The Weizmann Institute of Science presents a memorial lecture series in his honor.", "Anders P. Ravn": "\n\n- Anders Peter Ravn was a Danish computer scientist born in Venezuela in 1947.\n- He received a Master of Science in Computer Science and Mathematics from the University of Copenhagen in 1973 and a Doctor of Technology in Computer Science from the Technical University of Denmark in 1995.\n- He was a teaching assistant at the University of Copenhagen, worked as a systems programmer at A/S Regnecentralen and held various academic positions at different institutions, including guest researcher at Oxford University and visiting professor at the University of Kiel in Germany.\n- Ravn specialized in research into formal methods, especially for embedded and hybrid systems. He worked on the development of duration calculus for real-time systems with Zhou Chaochen and Tony Hoare.\n- He was a member of the Dansk Selskab for Datalogi, the Association for Computing Machinery and the IEEE Computer Society.\n- Ravn received Ulrik and Marie Brinch's honorary award in 1996 and was honoured as a Knight of the Order of the Dannebrog in 2015.\n- Ravn produced many research papers and edited several books.\n- He died in Copenhagen in 2019.", "Andrew Barto": "\n\n- Andrew G. Barto is an American computer scientist and Professor Emeritus at the University of Massachusetts Amherst.\n- He received his B.S. in mathematics from the University of Michigan in 1970 and later earned a Ph.D. in computer science for his work on cellular automata.\n- Barto joined the faculty at UMass in 1977, was department chair from 2007 to 2011, and co-directed the Autonomous Learning Laboratory.\n- He has published over 100 papers, co-authored the influential book Reinforcement Learning: An Introduction, and edited the Handbook of Learning and Approximate Dynamic Programming.\n- Barto has been recognized with several awards, including the UMass Neurosciences Lifetime Achievement Award, the IEEE Neural Network Society Pioneer Award, and the IJCAI Award for Research Excellence.\n- He is a Fellow of the American Association for the Advancement of Science, a Senior Member of the IEEE, and a member of the American Association for Artificial Intelligence and the Society for Neuroscience.", "Andrew Chi-Chih Yao": "- Andrew Chi-Chih Yao is a Chinese computer scientist and computational theorist.\n- He is currently a professor and the dean of the Institute for Interdisciplinary Information Sciences at Tsinghua University.\n- Yao used the minimax theorem to prove what is known as Yao's Principle.\n- He was born in Shanghai and completed his education at National Taiwan University, Harvard University, and University of Illinois at Urbana-Champaign.\n- He has worked as a professor at various universities including Massachusetts Institute of Technology, Stanford University, University of California, Berkeley, and Princeton University.\n- In 2015, he renounced his U.S. citizenship and became an academician of the Chinese Academy of Sciences.\n- Yao has received various awards including the Knuth Prize, the Turing Award, and the Kyoto Prize in Advanced Technology.\n- He is a member of the U.S. National Academy of Sciences, a fellow of the American Academy of Arts and Sciences, and a fellow of the Association for Computing Machinery.\n- Yao's wife, Frances Yao, is also a theoretical computer scientist.\n- Some of his notable works include Yao's test, Yao's Millionaires' Problem, and Garbled circuit.", "Andrew Donald Booth": "-Andrew Donald Booth was a British electrical engineer, physicist, and computer scientist.\n-He developed the magnetic drum memory for computers and Booth's multiplication algorithm.\n-Booth worked at Birkbeck College, University of London where he built some of the first electronic computers in the UK.\n-He founded the department of numerical automation at Birkbeck and did pioneering work in machine translation.\n-Booth served as the President of Lakehead University from 1972-1978.\n-He married mathematician and computer engineer Kathleen Britten and together they produced three computing machines.\n-Booth's works and bibliography can be found in the Andrew Booth Collection at the University of Manchester Library.", "Andrew Herbert": "- Andrew James Herbert is a British computer scientist and former Chairman of Microsoft Research for Europe, Middle East, and Africa.\n- He received a BSc in computational science from Leeds University in 1975 and a PhD in computer science from Cambridge University in 1978.\n- He worked at the University of Cambridge Computer Laboratory from 1978 to 1985 and founded Architecture Projects Ltd in 1985, which developed ANSA, an advanced network systems architecture.\n- He also founded Digitivity in 1996 to develop a product for secure deployment of Java clients and joined Citrix Systems in 1998 after their acquisition of APM and Digitivity.\n- Herbert joined Microsoft Research in 2001 and became managing director in 2003 and chairman in 2010 before retiring in 2011.\n- He is a Fellow of the Royal Academy of Engineering and the British Computer Society, and a former Liveryman of the City of London Worshipful Company of Information Technologists.\n- Herbert's research interests include computer networking, operating systems, distributed computing, programming languages, and large-scale data-driven systems.\n- His significant research achievements include the Cambridge CAP Computer operating system, and contributions to the Cambridge Model Distributed System and Advanced Networked Systems Architecture.\n- He has published several books and articles and is currently chairman of trustees for the National Museum of Computing at Bletchley Park.\n- Herbert also manages a project to construct a working replica of the Cambridge EDSAC computer at the museum, which is expected to be operational in 2021.", "Andrew Koenig (programmer)": "\n- Andrew Richard Koenig is a former AT&T and Bell Labs researcher and programmer who has authored books such as C Traps and Pitfalls, Accelerated C++, and Ruminations on C++. \n- He has also served as the Project Editor of the ISO/ANSI standards committee for C++ and has authored over 150 papers on the language. \n- Koenig is associated with argument-dependent name lookup, also known as \"Koenig lookup,\" and has been involved in several patents related to computer programming. \n- He was born in New York City and graduated from Columbia University, where he was a prominent member of the Columbia University Center for Computing Activities. \n- Koenig retired from Bell Labs in Murray Hill, New Jersey.", "Andrew McCallum": "\n\n- Andrew McCallum is a professor in the computer science department at University of Massachusetts Amherst.\n\n- His specialties are in machine learning, natural language processing, information extraction, information integration, and social network analysis.\n\n- McCallum graduated summa cum laude from Dartmouth College in 1989.\n\n- He completed his Ph.D. at University of Rochester in 1995 and was a postdoctoral fellow at Carnegie Mellon University.\n\n- From 1998 to 2000, he was a Research Scientist and Research Coordinator at Justsystem Pittsburgh Research Center.\n\n- From 2000 to 2002, he was Vice President of Research and Development at WhizBang Labs and Director of its Pittsburgh office.\n\n- In 2002, he joined the faculty at the University of Massachusetts Amherst as a professor of computer science.\n\n- In 2020, he also joined Google as a part-time research scientist.\n\n- McCallum was elected as a fellow of the Association for the Advancement of Artificial Intelligence in 2009 and as an Association for Computing Machinery in 2017.\n\n- He was the President of International Machine Learning Society from 2014 to 2017.\n\n- He is also the director of the Center for Data Science at UMass and leads a new partnership with the Chan and Zuckerberg Initiative.\n\n- McCallum developed conditional random fields with John D. Lafferty and Fernando Pereira and wrote widely used open-source software toolkits for machine learning, natural language processing, and other text processing.\n\n- He instigated and directs the nonprofit project OpenReview.net, an online platform that aims to promote openness in scientific communication, particularly the peer review process, by providing a flexible cloud-based web interface and underlying database API.\n\n- McCallum's Enron Corpus, a large collection of emails, has been used as a basis for a number of academic studies of social networking and language.", "Andrew Ng": "- Andrew Ng is a computer scientist and technology entrepreneur\n- He focuses on machine learning and artificial intelligence (AI)\n- Ng was a co-founder and head of Google Brain and the former Chief Scientist at Baidu\n- He is an adjunct professor at Stanford University and has made substantial contributions to the field of online education as the co-founder of Coursera and deeplearning.ai, teaching over 2.5 million students through his online courses\n- Ng has founded Landing AI, which provides AI-powered SaaS products, and launched the AI Fund, a $175-million investment fund for backing AI startups\n- He has won numerous awards for his work in AI, robotics, and related fields, and has authored over 300 publications\n- Ng is a strong believer in democratizing AI and lowering barriers to entry for businesses and developers. He also supports basic income to allow the unemployed to study AI to re-enter the workforce.", "Andrew S. Tanenbaum": "- Andrew Stuart Tanenbaum is an American-Dutch computer scientist and professor emeritus of computer science at the Vrije Universiteit Amsterdam in the Netherlands.\n- He is the author of MINIX, a free Unix-like operating system for teaching purposes, and has written multiple computer science textbooks regarded as standard texts in the field.\n- He regards his teaching job as his most important work and has supervised the work of many PhD candidates.\n- Tanenbaum has been involved in numerous research projects in the areas of operating systems, distributed systems, and ubiquitous computing.\n- He created Electoral-vote.com, a website analyzing opinion polls for the U.S. Presidential Election, using them to project the outcome in the Electoral College.\n- Tanenbaum is the architect of the Amsterdam Compiler Kit and wrote a clone of UNIX called MINIX.\n- In the Tanenbaum-Torvalds debate, he debated with Linus Torvalds regarding kernel design on Usenet in 1992.\n- Tanenbaum has received numerous awards, including Fellow of the ACM, Fellow of the IEEE, and Member of the Royal Netherlands Academy of Arts and Sciences, and honorary doctorates from Petru Maior University in Romania and Universitatea Politehnica din București. \n- He has been a keynote speaker at several conferences around the world.", "Andrew V. Goldberg": "\n\n- Andrew Vladislav Goldberg is an American computer scientist.\n- He primarily works on design, analysis, and experimental evaluation of algorithms.\n- He also worked on mechanism design, computer systems, and complexity theory.\n- Goldberg did his undergraduate studies at the Massachusetts Institute of Technology.\n- He earned a master's degree at the University of California, Berkeley, and finished his doctorate at MIT in 1987.\n- He was a faculty member at Stanford University and has worked for various organizations, including NEC Research Institute, Intertrust STAR Laboratories, Microsoft, and Amazon.com.\n- Goldberg is best known for his research on graph and network algorithms, including the maximum flow and shortest path problems.\n- He also worked on algorithmic game theory and was one of the first scientists to study worst-case mechanism design.\n- Goldberg has received numerous awards, including a Hertz Fellowship, A.W. Tucker Prize, NSF Presidential Young Investigator Award, and INFORMS Optimization Society Farkas Prize.\n- He is a fellow of the ACM and the Society for Industrial and Applied Mathematics.", "Andrew Viterbi": "\n\n- Andrew James Viterbi is an electrical engineer and businessman.\n- He co-founded Qualcomm Inc. and invented the Viterbi algorithm.\n- He is the Presidential Chair Professor of Electrical Engineering at the University of Southern California's Viterbi School of Engineering.\n- He was born in Bergamo, Italy, and immigrated to the United States two years before World War II.\n- He attended the Boston Latin School and received both BS and MS in electrical engineering from Massachusetts Institute of Technology (MIT).\n- He carried out PhD studies in digital communications at the University of Southern California, where he graduated in 1963.\n- He proposed the Viterbi algorithm to decode convolutionally encoded data in 1967.\n- He also helped to develop the Code Division Multiple Access (CDMA) standard for cell phone networks.\n- He was the co-founder of Linkabit Corporation and Qualcomm Inc.\n- He received many awards and honors throughout his career, including the Benjamin Franklin Medal in Electrical Engineering in 2005, the National Medal of Science in 2008, and the IEEE Medal of Honor in 2010.\n- He was married to Erna Finci, a Jewish refugee from Sarajevo who was a Shoah survivor, and they had three children.", "Andrey Nikolaevich Kolmogorov": "\n\n- Andrey Nikolaevich Kolmogorov was a Soviet mathematician born in 1903.\n- He made significant contributions to the mathematics of probability theory, topology, intuitionistic logic, turbulence, classical mechanics, algorithmic information theory, and computational complexity.\n- Kolmogorov began his studies at Moscow State University in 1920 and gained international recognition in 1922.\n- He formed a lifelong friendship with fellow student Pavel Alexandrov and became interested in probability theory.\n- In 1933, Kolmogorov published \"Foundations of the Theory of Probability,\" laying the modern axiomatic foundations of probability theory.\n- During World War II, Kolmogorov contributed to the Soviet war effort by applying statistical theory to artillery fire.\n- Kolmogorov married Anna Dmitrievna Egorova in 1942 and was actively involved in developing pedagogy for gifted children.\n- Kolmogorov received numerous awards and honors during and after his lifetime.\n- His legacy continues to influence the field of mathematics today.", "Andries van Dam": "\n\n- Andries \"Andy\" van Dam is a Dutch-American professor of computer science at Brown University.\n- He contributed to the first hypertext system, Hypertext Editing System (HES), along with Ted Nelson.\n- He co-authored the popular textbook in computer graphics, Computer Graphics: Principles and Practice.\n- Van Dam co-founded the precursor of today's ACM SIGGRAPH conference.\n- He mentored several students in hypertext and computer graphics, including Randy Pausch.\n- Van Dam helped found the computer science program at Brown and served as its first chair.\n- He received his Ph.D. in Computer Science from the University of Pennsylvania in 1966.\n- Van Dam's continued interest in hypertext was crucial to the development of modern markup and browsing technology.\n- He serves on several technical boards and committees and has received several awards and recognitions.\n- Van Dam demanded that the Brown Center for Information Technology include showers and a Chinese restaurant, and the showers were built.\n- The character of Andy in the film Toy Story is named after van Dam, and his book appears on the character's bookshelf.\n- A documentary film about van Dam and hypertext, titled \"An Educational Experiment in English and Computer Science at Brown University,\" is available on IMDb and the Internet Archive.", "Anil K. Jain (computer scientist, born 1948)": "- Anil Kumar Jain is a computer scientist and University Distinguished Professor at Michigan State University.\n- He is known for his contributions in pattern recognition, computer vision, and biometric recognition.\n- He received his PhD from Ohio State University and taught at Wayne State University before joining MSU in 1974.\n- Jain has an h-index of 208, which is the highest among computer scientists identified in a survey published by UCLA.\n- He has received numerous awards and is a Fellow of ACM, IEEE, AAAS, IAPR, and SPIE.\n- Jain has written several books and published numerous research and survey articles in the field of computer science, including on artificial neural networks, data clustering, and biometric recognition.\n- He has served on U.S. National Academies panels on Information Technology, Whither Biometrics, and Improvised Explosive Devices.\n- Jain was elected to the National Academy of Engineering in 2016 and the Indian National Academy of Engineering.\n- He was also elected as a Foreign Member of the Chinese Academy of Sciences in 2019.\n- His research focuses on biometric recognition technologies, including fingerprint and face recognition.", "Anita Borg": "\n\n- Anita Borg was an American computer scientist known for advocating for women’s representation and professional advancement in technology.\n- She founded the Institute for Women and Technology and the Grace Hopper Celebration of Women in Computing.\n- Borg got her first programming job in 1969 and was awarded a PhD in Computer Science by New York University in 1981.\n- Borg spent four years building a fault tolerant Unix-based operating system and developed MECCA, an email and Web-based system for communicating in virtual communities.\n- In 1987, Borg founded Systers, the first email network for women in technology and oversaw it until 2000.\n- She co-founded the Grace Hopper Celebration of Women in Computing in 1994 and founded the Institute for Women and Technology in 1997.\n- Borg received several awards and was recognized for her accomplishments as a computer scientist and for her work on behalf of women in computing.\n- She was diagnosed with a brain tumor in 1999 and died in 2003.\n- Several awards and programs honor Borg's life and work, such as the Google Anita Borg Memorial Scholarship and the UNSW Anita Borg Prize.", "Annie Easley": "\n\n- Annie Jean Easley was an American computer scientist, mathematician, and rocket scientist.\n- She worked for the Lewis Research Center and NASA, and was one of the first African Americans to work at NASA.\n- Easley was a leading member of the team which developed software for the Centaur rocket stage.\n- She was posthumously inducted into the Glenn Research Hall of Fame in 2015, and in 2021 a crater on the moon was named after her.\n- Easley received a Bachelor of Science in Mathematics from Cleveland State University.\n- She faced discrimination related to being an African-American during her career, especially when her face was cut out of a photograph at work.\n- Easley's work with the Centaur project helped lay the technological foundations for future space shuttle launches.\n- She was also an advocate for and encouraged female and minority students to work in STEM careers and tutored young adults who dropped out of school.\n- Easley focused on volunteer work after retiring from NASA, becoming an independent contractor in real estate.\n- Some of Easley's selected works include Performance and Operational Economics Estimates for a Coal Gasification Combined-Cycle Cogeneration Powerplant and Effect of Turbulent Mixing on Average Fuel Temperatures in a Gas-Core Nuclear Rocket Engine.", "Aravind K. Joshi": "\n\n- Aravind Krishna Joshi was a professor in the computer science department of the University of Pennsylvania.\n- Joshi defined the tree-adjoining grammar formalism used in computational linguistics and natural language processing.\n- He received his BE in electrical engineering and DIISc in communication engineering from Pune University and the Indian Institute of Science, respectively.\n- Joshi earned his PhD from the electrical engineering department at the University of Pennsylvania in 1960.\n- He co-founded and co-directed the Institute for Research in Cognitive Science.\n- Joshi received numerous awards and recognition including the Guggenheim fellowship, IEEE fellow, and ACM fellow.\n- He was elected to the National Academy of Engineering and awarded the Rumelhart Prize and the Franklin Institute's Benjamin Franklin Medal.\n- Joshi was the first recipient of the Association for Computational Linguistics Lifetime Achievement Award.\n- He passed away on December 31, 2017.", "Arne Sølvberg": "- Arne Sølvberg is a Norwegian computer scientist and professor in computer science at NTNU in Trondheim.\n- He is an expert in the field of information modelling.\n- Sølvberg received his MSc in applied physics in 1963 and his PhD in computer science in 1971 from NTNU.\n- Between 1963 and 1974, he worked at SINTEF Runnit and led their information systems group.\n- In 1974, Sølvberg became the first professor of computer science at NTNU and has been dean of NTNU's Faculty of Information Technology, Mathematics and Electrical Engineering since 2002.\n- He has served in various leadership positions in international organizations and co-founded the CAiSE conference series.\n- Sølvberg's research interests include information systems design methodology, database design, information modelling, information systems engineering environments, and model-driven design.\n- He has published numerous papers and books, including \"An Introduction to Information Systems Engineering\" and \"Information Systems Engineering: State of the Art and Research Themes.\"\n- Sølvberg is a fellow of the Norwegian Academy of Technological Sciences and is married to Ingeborg Sølvberg.", "Arvind (computer scientist)": "\n\n- Arvind is the Johnson Professor of Computer Science and Engineering at MIT.\n- He is a Fellow of IEEE and ACM, and a member of the National Academy of Engineering.\n- His research includes formal verification of large-scale digital systems and cache coherence protocols for parallel architectures and languages.\n- Arvind earned his Bachelor's degree in electrical engineering from IIT Kanpur, and his Master's and PhD in computer science from the University of Minnesota.\n- He has co-founded two electronic design automation companies: Sandburst and Bluespec.\n- Arvind's current research uses term-rewriting systems for high-level specification and description of architectures and protocols.\n- He has authored or co-authored several significant articles and books, including \"Implicit parallel programming in pH\" with R.S. Nikhil.\n- Arvind has received several awards, including the IEEE Computer Society Charles Babbage Award, Distinguished Alumnus Awards from IIT Kanpur and the University of Minnesota, and the Outstanding Achievement Award from the University of Minnesota.", "Ashok Goel": "\n\n- Ashok K. Goel is a professor of computer science and human-centered computing at Georgia Institute of Technology, and the chief scientist with Georgia Tech's Center for 21st Century Universities.\n- He conducts research into cognitive systems at the intersection of artificial intelligence and cognitive science with a focus on computational design and creativity.\n- He is the executive director of National Science Foundation's AI Institute for Adult Learning and Online Education and an editor emeritus of AAAI's AI Magazine.\n- His research revolves around conceptual design of technical systems and learning about complex systems and systems thinking.\n- He has developed computational tools such as the Design by Analogy to Nature Engine for supporting conceptual design.\n- He has developed an online course on Knowledge-Based AI and developed Jill Watson, a virtual teaching assistant for automatically answering students’ questions in discussion forums of online classes.\n- He has co-edited books on biologically inspired design and blended learning in practice.\n- He has received AAAI's Outstanding AI Educator Award and the University System of Georgia Regent's Award for Scholarship of Teaching and Learning.\n- His teaching and research have been featured in various media outlets.", "Atta ur Rehman Khan": "\n\n- Atta ur Rehman Khan is a Pakistani computer scientist and academician.\n- He is among the World's Top 2% Scientists according to a Stanford University report.\n- He is the founder of National Cyber Crime Forensics Lab Pakistan, which operates in partnership with NR3C.\n- He has published numerous research articles and books and is a senior member of IEEE and ACM.\n- He received his PhD degree in Computer Science from the University of Malaya.\n- As of 2010, he is working as an Associate Professor at the College of Engineering and Information Technology, Ajman University, United Arab Emirates.\n- He has experience teaching and researching at seven universities.\n- He is an editor and associate editor of several journals.\n- He has received numerous honors and awards, such as the Long-Term Research Achievement Award (2023) and the World's Top 2% Scientists award (2022, 2020) from Stanford University.\n- He has authored/co-authored/edited several books and numerous research papers on various topics in computer science.", "Austin Tate": "- Austin Tate is an Emeritus Professor of Knowledge-based systems at the University of Edinburgh.\n- He was the Director of the Artificial Intelligence Applications Institute from 1985 to 2019.\n- Tate's research interests are in Artificial Intelligence.\n- Some of his selected publications are Generating Project Networks, O-Plan: The open planning architecture, and Task Achieving Agents on the World Wide Web.\n- Tate has received various awards such as being elected a Fellow of the Royal Society of Edinburgh and Elected a Fellow of the Royal Academy of Engineering.\n- He was married to Margaret (née Mowbray) in 1975 at Knottingley, West Yorkshire, England.", "Avie Tevanian": "- Avadis \"Avie\" Tevanian is an American software engineer born in 1961.\n\n- He was a principal designer and engineer of the Mach operating system at Carnegie Mellon University.\n\n- Tevanian then designed the NeXTSTEP operating system at NeXT Inc., where he was Vice President of Software Engineering.\n\n- He became senior vice president of software engineering at Apple from 1997 to 2003, and then chief software technology officer from 2003 to 2006.\n\n- At Apple, he redesigned NeXTSTEP to become macOS and iOS, with other operating systems like iPadOS, watchOS, and tvOS stemming from iOS.\n\n- Tevanian was a witness for the United States Department of Justice in United States v. Microsoft in 2001.\n\n- After leaving Apple in 2006, he joined the board of Dolby Labs and Theranos, Inc., but left the board of Theranos in late 2007 under acrimonious circumstances.\n\n- He became Managing Director of Elevation Partners in 2010 and cofounded NextEquity Partners in 2015, where he currently serves as Managing Director.\n\n- Tevanian is of Armenian descent and has a B.A. in mathematics from the University of Rochester and M.S. and Ph.D. degrees in computer science from Carnegie Mellon University.", "Avinash Kak": "\n\n- Avinash C. Kak is a professor of Electrical and Computer Engineering at Purdue University.\n- He has conducted research in information processing, with notable contributions in algorithms, languages, and systems related to robotics, computer vision, and networks (including sensor networks).\n- His contributions to robotics and computer vision include the development of the 3D-POLY algorithm for recognizing 3D objects in depth maps and the FINALE approach to vision-based navigation by indoor mobile robots.\n- Kak's research in image reconstruction algorithms includes the SART algorithm, widely used in CT imaging applications.\n- He has authored several books, including Digital Picture Processing (co-authored with Azriel Rosenfeld) and Principles of Computerized Tomographic Imaging.\n- Kak has also contributed to the fields of software engineering and open source, developing software modules widely used for data analytics and computer security.\n- In addition, he has contributed to computer and network security research, presenting a solution to the problem of botnet detection in computer networks.\n- Kak's online lecture notes provide a comprehensive overview of computer and network security.", "Azriel Rosenfeld": "- Azriel Rosenfeld was a prominent American Research Professor and Director of the Center for Automation Research at the University of Maryland.\n- He had affiliate professorships in the Departments of Computer Science, Electrical Engineering, and Psychology.\n- Rosenfeld was a leading researcher in the field of computer image analysis, making fundamental and pioneering contributions to nearly every area of the field.\n- His research formed the foundation for a generation of industrial vision inspection systems that have found widespread applications.\n- He wrote the first textbook in the field of image analysis (1969), founded the first journal, Computer Graphics and Image Processing (1972), and co-chaired the first international conference (1987).\n- Rosenfeld held a Ph.D. in mathematics, rabbinic ordination, and a Doctor of Hebrew Literature degree from Yeshiva University, and honorary degrees from Linkoping University, Oulu University, and Yeshiva University.\n- He was awarded an honorary Doctor of Science degree from the Technion (2004, conferred posthumously).\n- Rosenfeld was a ba'al koreh (Torah Reader) at Young Israel Shomrai Emunah of Greater Washington.\n- The biennial Azriel Rosenfeld Award is given in recognition of an outstanding life-time contribution to the field of image understanding or computer vision.\n- He published over 30 books, over 600 book chapters and journal articles, and directed nearly 60 Ph.D. dissertations.", "Barbara Engelhardt": "\n\n- Barbara Elizabeth Engelhardt is a computer scientist and specialist in bioinformatics.\n- She is a Professor at Stanford University and her work focuses on latent variable models, exploratory data analysis for genomic data, and QTLs.\n- Engelhardt received a Bachelor of Science and a Master of Science from Stanford University and a PhD from the University of California, Berkeley.\n- Engelhardt worked as a postdoctoral researcher at the University of Chicago and later joined Duke University and Princeton University as an assistant professor.\n- In 2022, she moved to California and currently holds the position of Professor at Stanford University and Gladstone Institute of Data Science and Biotechnology.\n- Engelhardt's research has been funded by the National Institutes of Health through two R01 grants and she has been recognized by several awards including the Overton Prize by the International Society for Computational Biology.\n- She has also served on the Board of Directors for Women in Machine Learning and as Diversity & Inclusion Co-chair at the International Conference on Machine Learning.\n- Engelhardt's work has been featured in Quanta Magazine and she gave a TEDx talk entitled \"Not What but Why: Machine Learning for Understanding Genomics.\"", "Barbara Liskov": "- Barbara Liskov is an American computer scientist.\n- She made pioneering contributions to programming languages and distributed computing.\n- She developed the Liskov substitution principle which is used in type theory and object-oriented programming.\n- Liskov is one of the earliest women to have been granted a doctorate in computer science in the United States.\n- She is currently an Institute Professor and Ford Professor of Engineering at the Massachusetts Institute of Technology.\n- Liskov has led many significant projects including the Venus operating system, CLU, Argus, and Thor.\n- She received the 2008 Turing Award, the highest distinction in computer science, for her work in the design of programming languages and software methodology that led to the development of object-oriented programming.\n- Liskov is the author of five books and over one hundred technical papers.\n- She is a member of the National Academy of Engineering, the National Academy of Sciences, and a fellow of the American Academy of Arts and Sciences and the Association for Computing Machinery.\n- Liskov was recognized as one of the top women faculty members at MIT, and among the top 50 faculty members in the sciences in the U.S.\n- She is married to Nathan Liskov and they have one son named Moses.", "Barry Boehm": "- Barry William Boehm was an American software engineer and professor of computer science and industrial and systems engineering.\n- He was the founding director of the Center for Systems and Software Engineering at the University of Southern California.\n- Boehm's contributions to software engineering included the Constructive Cost Model (COCOMO), the spiral model of software development, and the Wideband Delphi method of estimation.\n- His research interests included software development process modeling, software requirements engineering, software architectures, software metrics and cost models, software engineering environments, and knowledge-based software engineering.\n- He received numerous awards, including the ACM Distinguished Research Award in Software Engineering in 1997 and the IEEE Simon Ramo Medal in 2010.\n- Boehm predicted in a 1973 report that software costs would overwhelm hardware costs, inspiring a change in direction in computing.\n- He published over 170 articles and several books, including Software Engineering Economics and Balancing Agility and Discipline.\n- Honorary degrees were conferred upon Boehm by the U. of Massachusetts in 2000 and by the Chinese Academy of Sciences in 2011.\n- In 1996, Boehm was elected as a member of the National Academy of Engineering for his contributions to computer and software architectures and models of cost, quality, and risk for aerospace systems.\n- Boehm passed away on August 20, 2022.", "Beatrice Helen Worsley": "-Beatrice Helen Worsley was a Canadian computer scientist and the first female computer scientist in Canada \n\n-She received her Ph.D. degree from the University of Cambridge and wrote the first program to run on EDSAC \n\n-Worsley co-wrote the first compiler for Toronto's Ferranti Mark 1 and taught computers and engineering at Queen's University and the University of Toronto for over 20 years before her death at the age of 50 \n\n-Worsley was born in 1921 in Toronto and excelled in mathematics and science, graduating with the Governor General's Award \n\n-During World War II, Worsley enlisted in the Women's Royal Canadian Naval Service and eventually studied at MIT for a year \n\n-After returning to Canada, Worsley worked at the National Research Council of Canada before joining the newly created computing department at the University of Toronto \n\n-Worsley's contributions to computing include her dissertation on modern computers, the creation of Transcode programming language, and her work on the FERUT computer \n\n-She was repeatedly passed over for promotions at the University of Toronto and eventually took up a teaching position at Queen's University \n\n-Worsley received the Lifetime Achievement Award in Computer Science from the Canadian Association of Computer Science in 2014.", "Ben Shneiderman": "\n\n- Ben Shneiderman is an American computer scientist and a Distinguished University Professor at the University of Maryland Department of Computer Science.\n- He is the founding director (1983-2000) of the University of Maryland Human-Computer Interaction Lab.\n- Shneiderman is known for his contributions in the field of human-computer interaction, including developing the direct manipulation interface and his eight rules of design.\n- He received numerous awards and honors, including being inducted as a Fellow of the Association for Computing Machinery and the American Association for the Advancement of Science.\n- Shneiderman's major works include \"Designing the User Interface: Strategies for Effective Human-Computer Interaction\", the treemap concept for hierarchical data visualization, and a taxonomy of interactive dynamics for visual analysis.\n- He proposed the research area of universal usability and is currently focusing on the topic of human-centered artificial intelligence.", "Bernard Richards": "\n\n- Bernard Richards is a British computer scientist and Emeritus Professor of Medical Informatics at the University of Manchester.\n- He studied mathematics and physics for his bachelor's degree and worked under the supervision of Alan Turing for his master's degree, helping to validate Turing's theory of morphogenesis.\n- Richards changed his research area after Turing's death and worked on studying optics for his doctorate, resulting in a Royal Society paper with his supervisor.\n- Later, he worked on hormone peaks in the menstrual cycle and expert systems for open heart surgery and intensive care units.\n- Richards has held various positions, including Chairman of the BCS Health Informatics Committee and first President of the Institute for Health Record and Information Management.\n- He has also received multiple honors, including being made BCS Fellow of the Year for Services to Medical Informatics and receiving awards from Queen Elizabeth II for contributing to a time capsule during Turing's centenary year.", "Bernard de Neumann": "\n\n- Frederick Bernard de Neumann (1943-2018) was a British mathematician, computer scientist, inventor, and naval historian.\n- He was educated at the Royal Hospital School and Birmingham University.\n- Neumann was a Professor of Mathematics at The City University.\n- He was a descendant of Johann Andreas von Neumann and Johann Heinrich von Neumann, both of noble birth.\n- In 2005, a portrait of Neumann won the Ondaatje Prize from the Royal Society of Portrait Painters.\n- The Neumann family is featured in the Genealogisches Handbuch des in Bayern immatrikulierten Adels. \n- The London Mathematical Society Newsletter also featured a prize for a portrait of Neumann in 2005.", "Bernhard Schölkopf": "- Bernhard Schölkopf is a German computer scientist born on February 20, 1968.\n- He is known for his work in machine learning, especially on kernel methods and causality.\n- He is a director at the Max Planck Institute for Intelligent Systems in Tübingen, Germany, where he heads the Department of Empirical Inference.\n- Schölkopf is also an affiliated professor at ETH Zürich, honorary professor at the University of Tübingen and the Technical University Berlin, and chairman of the European Laboratory for Learning and Intelligent Systems (ELLIS).\n- He developed kernel support vector machine (SVM) methods and introduced kernel principal component analysis (PCA), which led to the foundation of the field of kernel methods.\n- Schölkopf also developed methods for causal inference and showed how to exploit underlying causal structures to make machine learning methods more robust with respect to distribution shifts and systematic errors.\n- He completed a Diplom in Physics and won the annual award of the German Informatics Association for his PhD thesis defended in 1997.\n- He founded the Department for Empirical Inference at the Max Planck Institute for Biological Cybernetics, which grew into a leading center for research in machine learning.\n- He is co-editor-in-Chief of the Journal of Machine Learning Research and among the world’s most cited computer scientists.\n- Schölkopf’s awards include the Royal Society Milner Award and the BBVA Foundation Frontiers of Knowledge Award in the Information and Communication Technologies category, shared with Isabelle Guyon and Vladimir Vapnik.", "Bernhard Thalheim": "- Bernhard Karl Thalheim is a German computer scientist and professor of information systems engineering at the University of Kiel in Kiel, Germany.\n- He is known for his work on conceptual modeling and its theoretical foundational contributions.\n- Thalheim received his M.Sc. in mathematics and computer science in 1975 at the Dresden University of Technology, his PhD in discrete mathematics in 1979 at the Lomonosov Moscow State University, and his habilitation in theoretical computer science in 1985 at the Dresden University of Technology.\n- Thalheim has been a visiting professor at several universities around the world.\n- Thalheim has received a number of awards for his achievements in information systems engineering.\n- Thalheim's foundational contributions to conceptual modeling theory and science can be found at multiple levels and abstractions.\n- His work has been applied in fields such as semantics in databases, co-design of information systems applications, and business process modeling.\n- Thalheim has published several books, papers, and articles on various topics in computer science and information systems engineering.", "Bert Bos": "\n\n- Gijsbert (Bert) Bos is a computer scientist known for the development of Argo, a web browser he developed as a test application for his style sheet proposal.\n- Bos studied mathematics at the University of Groningen and wrote his PhD thesis on Rapid user interface development with the script language Gist.\n- In 1996, he joined the World Wide Web Consortium (W3C) to work on Cascading Style Sheets (CSS).\n- Bos is a former chairman and the current W3C Staff Contact of the CSS Working Group.\n- He is based in Sophia Antipolis, France.\n- Bos, along with Håkon Wium Lie, has written a book about Cascading Style Sheets. The book is titled \"Cascading Style Sheets: Designing for the Web\" and has three editions with different ISBNs.\n- Bos' homepage at W3C is available as an external link.", "Bertrand Meyer": "\n\n- Bertrand Meyer is a French academic, author and consultant in the field of computer languages.\n- He created the Eiffel programming language and the idea of design by contract.\n- Meyer received a master's degree in engineering from the École Polytechnique, a second master's degree from Stanford University, and a PhD from the Université de Nancy.\n- He was a member of the faculty of the University of California, Santa Barbara and professor of software engineering at ETH Zürich from 2001 to 2016.\n- Meyer is known for his contributions, including the concept of Design by Contract, the design of the Eiffel language, and the establishment of the connection between object-oriented programming and software reusability.\n- He has received numerous awards and is a member of Academia Europaea and the French Academy of Technologies and a Fellow of the ACM.\n- There was a Wikipedia hoax falsely announcing Meyer's death in 2005, which he used to evaluate the resilience of the system.", "Betty Holberton": "\n\n- Frances Elizabeth Holberton was an American computer scientist and one of the six original programmers of the first general-purpose electronic digital computer, ENIAC.\n- Holberton invented breakpoints in computer debugging.\n- She studied journalism at the University of Pennsylvania and was hired by the Moore School of Engineering during World War 2 to work as a \"computer\".\n- Holberton helped develop the UNIVAC and was one of those who wrote the first generative programming system (SORT/MERGE). \n- She worked with John Mauchly to develop the C-10 instruction set for BINAC and participated in the development of early standards for the COBOL and FORTRAN programming languages with Grace Hopper.\n- Holberton received many awards and was posthumously honored with the Holberton School, a project-based school for software engineers based in San Francisco.\n- She died in 2001 of heart disease, diabetes, and complications from a stroke.\n- A documentary titled \"Top Secret Rosies: The Female 'Computers' of WWII\" was released in 2010, featuring interviews with some of the ENIAC programmers.\n- The ENIAC team is also the inspiration behind the 2013 documentary, \"The Computers,\" which is part of a series of three.", "Bigtable": "\n\n- Bigtable is a fully managed NoSQL database service.\n- It was developed by Google in 2004 and is used by many Google applications.\n- Bigtable scales into the petabyte range and can handle hundreds to thousands of machines.\n- It is not a relational database but is a sparse, distributed multi-dimensional sorted map.\n- Tables are split into multiple tablets and compressed using the BMDiff and Snappy compression algorithm.\n- Bigtable manages over 10 Exabytes of data and serves more than 5 billion requests per second.\n- It is available as a part of Google Cloud under the name Cloud Bigtable.\n- Bigtable is one of the prototypical examples of a wide-column store.\n- Apache HBase and Cassandra are some of the best-known open source projects based on Bigtable.", "Bill Gropp": "\n\n- William Douglas Gropp is the director of the National Center for Supercomputing Applications (NCSA) and the Thomas M. Siebel Chair in the Department of Computer Science at the University of Illinois. \n- He is the founding Director of the Parallel Computing Institute.\n- Gropp helped create the Message Passing Interface (MPI) and the Portable, Extensible Toolkit for Scientific Computation (PETSc).\n- Gropp has received awards including the Sidney Fernbach Award, the ACM/IEEE-CS Ken Kennedy Award, and an R&D 100 Award for PETSc.\n- In 2010, he was elected to the National Academy of Engineering and received the IEEE TCSC Medal for Excellence in Scalable Computing.\n- Gropp received his PhD at Stanford in 1982 under Joseph Oliger.\n- He is a Fellow of ACM, IEEE, and SIAM, and an elected member of the National Academy of Engineering.", "Bill Joy": "- William Nelson Joy is an American computer engineer and venture capitalist\n- He co-founded Sun Microsystems in 1982 and served as Chief Scientist and CTO at the company until 2003\n- He played a key role in the development of BSD UNIX and was the original author of the vi text editor\n- Joy was elected a member of the National Academy of Engineering in 1999\n- He co-founded venture capital firm HighBAR Ventures in 1999, and joined Kleiner Perkins in 2005\n- In 2000, he wrote an essay titled \"Why The Future Doesn't Need Us,\" expressing concerns over the risks of technological developments in genetics, nanotechnology, and robotics\n- Despite his concerns, Joy is a venture capitalist investing in GNR technology\n- Joy is credited with establishing \"Joy's law,\" stating that most of the smartest people work for someone else, and that companies should hire the best employees\n- Joy also devised a formula in 1983 called Joy's law, stating that peak computer speed doubles each year, expressed in MIPS", "Bjarne Stroustrup": "\n\n- Bjarne Stroustrup is a Danish computer scientist.\n- He is most notable for inventing and developing the C++ programming language.\n- He attended Aarhus University and graduated with a master's degree in mathematics and computer science.\n- He received a PhD in computer science from the University of Cambridge, where he studied communication in distributed computer systems.\n- He began his career as a member of technical staff at Bell Labs in 1979 and developed C++ there.\n- He has held various positions, including the head of AT&T Bell Labs' Large-scale Programming Research department and the College of Engineering Chair Professor in Computer Science at Texas A&M University.\n- As of July 2022, Stroustrup is a professor of Computer Science at Columbia University.\n- Stroustrup has written books and published over 100 academic articles on C++.\n- He has received numerous awards and honors, including The Charles Stark Draper Prize from The US National Academy of Engineering in 2018 for conceptualizing and developing the C++ programming language.\n- Stroustrup is a founding member of the C++ standards committee and has remained an active member ever since.", "Bonnie Nardi": "\n\n- Bonnie Nardi is an emeritus professor at the University of California, Irvine and led the TechDec research lab in Human-Computer Interaction and computer-supported cooperative work.\n- Her work includes research on activity theory, interaction design, games, social media, and society and technology.\n- Nardi has worked for high-tech companies such as AT&T Labs, Agilent, Hewlett-Packard and Apple labs to examine consumers' behavior.\n- She has published several books on activity theory and interaction design, including \"Acting with Technology\" and \"Activity Theory in HCI\".\n- Nardi's research interests focus on human-computer interaction, computer-supported cooperative work, activity theory, computer-mediated communication, and interaction design.\n- She is widely known for her work on information ecologies, especially Chapter 7 of her book \"Information Ecologies\", which focused on librarians as keystone species.\n- Nardi holds a PhD from the School of Social Sciences at University of California, Irvine, and her self-described theoretical orientation is \"activity theory\".\n- She is currently conducting an ethnographic study of World of Warcraft.\n- Nardi has authored several papers published in academic journals, such as \"NetWORKers and their activity in intensional networks\" and \"Why We Blog\".\n- Her work has influenced digital anthropology, digital libraries, and other fields in computer science.\n- She was elected to the ACM CHI academy in 2013 and retired in 2018.", "Brian Cantwell Smith": "\n\n- Brian Cantwell Smith is a philosopher and cognitive scientist.\n- He works in the fields of cognitive science, computer science, information studies, and philosophy.\n- Smith's research focuses on the foundations and philosophy of computing and computational metaphors in other fields.\n- He is currently a professor at the University of Toronto.\n- Smith received his BS, MS, and PhD degrees from MIT.\n- His doctoral dissertation introduced the notion of computational reflection in programming languages.\n- He was a founder of the Center for the Study of Language and Information at Stanford University.\n- Smith has published more than 35 articles and three books.\n- One of his books is called On the Origin of Objects.\n- He previously held a Canada Research Chair in the Foundations of Information.\n- Smith is cross-appointed as Professor in the departments of Philosophy and Computer Science and in the Program in Communication, Culture and Technology at University of Toronto at Mississauga.\n- His father was the scholar of religion Wilfred Cantwell Smith.", "Brian Kernighan": "\n\n- Brian Wilson Kernighan is a Canadian computer scientist.\n- He contributed to the development of Unix alongside Unix creators Ken Thompson and Dennis Ritchie while working at Bell Labs.\n- Kernighan is the co-author of the first book on the C programming language with Dennis Ritchie.\n- He authored many Unix programs, including ditroff, and is the co-author of the AWK and AMPL programming languages.\n- Kernighan and Shen Lin devised famous heuristics for two NP-complete optimization problems: graph partitioning and the travelling salesman problem, known as the Kernighan–Lin algorithm and the Lin–Kernighan heuristic respectively.\n- Kernighan has been a Professor of Computer Science at Princeton University since 2000 and is the Director of Undergraduate Studies in the Department of Computer Science.\n- In 2015, he co-authored the book The Go Programming Language.\n- Kernighan is the author of many books and reports, including The C Programming Language, The Practice of Programming, and The Unix Programming Environment.\n- He wrote a famous criticism of Niklaus Wirth's Pascal titled \"Why Pascal is Not My Favorite Programming Language\".\n- Kernighan is the author of several algorithms, including the first documented \"Hello, world!\" program, ditroff, eqn, Ratfor, m4, AWK, AMPL, and pic.\n- Kernighan uses a 13-inch MacBook Air as his primary device and uses Sam as his text editor.", "Bruce Arden": "\n\n- Bruce Wesley Arden was an American computer scientist who lived from 1927 to 2021.\n- He served in the U.S. Navy during World War II as a Radar Technician Third Class.\n- Arden graduated from Purdue University in 1949 with a BS(EE) and began his computing career in 1950 at the Allison Division of General Motors.\n- He co-authored two compilers and was involved in the initial design of the Michigan Terminal System (MTS) time-sharing operating system while working at the University of Michigan.\n- Arden completed his doctoral program in electrical engineering in 1965 and became a professor and chairman of the Computer and Communication Sciences department at the University of Michigan.\n- He later accepted a professorship at Princeton University and then became the Dean of the College of Engineering and Applied Science at the University of Rochester.\n- Arden wrote two books on numerical computation and supervised many students in their studies of computing.\n- He retired in 1995 and lived in Michigan and Maine.", "Bruce Schneier": "- Bruce Schneier is an American cryptographer, computer security professional, privacy specialist, and writer.\n- He is a lecturer in public policy at the Harvard Kennedy School and a fellow at the Berkman Klein Center for Internet & Society.\n- Schneier is a board member of the Electronic Frontier Foundation and an advisory board member of several other organizations.\n- He has authored several books on general security topics, computer security, and cryptography.\n- Schneier also writes a monthly internet newsletter and maintains a security weblog.\n- He is frequently quoted in the press on security and cryptography issues.\n- Schneier has been involved in the development of several cryptographic algorithms.\n- He is critical of digital rights management and is a proponent of full disclosure in security issues.\n- Schneier has advocated for spending homeland security money on intelligence, investigation, and emergency response.\n- He coined the term \"movie-plot threat\" to describe dramatic terrorist attack scenarios and is a critic of security measures that protect against them.\n- Schneier believes that designing systems to fail well is more important than trying to prevent all malicious incursions.", "Bryan Cantrill": "- Bryan M. Cantrill is an American software engineer.\n- He worked at Sun Microsystems and later at Oracle Corporation after its acquisition of Sun.\n- He left Oracle in 2010 to become Vice President of Engineering at Joyent, later transitioning to Chief Technology Officer in 2014 until his departure in 2019.\n- Cantrill is now the CTO of Oxide Computer company.\n- He is known for his development of DTrace, a function of the OS Solaris 10 for tracing and diagnosis of software.\n- Cantrill was named one of the 35 Top Young Innovators by Technology Review in 2005.\n- He was a member of the ACM Queue Editorial Board.\n- Cantrill was involved in the founding of Fishworks, a project at Sun Microsystems that produced the Sun Storage 7000 Unified Storage Systems.\n- In a 1996 technical discussion, Cantrill made a controversial comment to Linux kernel developer David S. Miller that later caused regret.\n- In 2010, Cantrill compared Oracle's behavior to that of Nazis after leaving the company.\n- Cantrill has expressed a preference for permissive open source software licenses over copyleft licenses.", "Butler Lampson": "\n\n- Butler W. Lampson is an American computer scientist known for his contributions to distributed personal computing.\n- His early education includes an A.B. in physics from Harvard University and a PhD in electrical engineering and computer science from the University of California, Berkeley.\n- Lampson was one of the founding members of Xerox PARC, where he worked as a principal scientist and senior research fellow, and helped design the Xerox Alto, the first personal computer with a graphical user interface (GUI).\n- Lampson also worked on many other influential technologies at PARC, such as laser printer design, Ethernet, and the Bravo program.\n- He later worked for Digital Equipment Corporation and Microsoft Research.\n- Lampson has received numerous honors and awards throughout his career, including the ACM Turing Award, the IEEE John von Neumann Medal, and the Charles Stark Draper Prize.\n- He is often quoted as saying, \"Any problem in computer science can be solved with another level of indirection\".\n- Lampson's website and an oral history interview with him are available online.", "Börje Langefors": "\n\n- Börje Langefors was a Swedish engineer and computer scientist, and Emeritus Professor of Business Information Systems at the Department of Computer and Systems Science, Stockholm University and Royal Institute of Technology, Stockholm.\n- He was born in Ystad, Sweden in 1915 and received his training from the Royal Institute of Technology, Stockholm.\n- Langefors was a key player in founding the IFIP TC8 Technical Committee of Information Systems in 1976.\n- A major achievement of his work is the formulation of the 'infological equation' describing the difference between data and information.\n- Langefors published numerous papers in journals, books, and archival proceedings since the 1970s.\n- An annual award titled Börje Langeforspriset has been announced by the Swedish Information Systems Academy since 2011 for the best doctoral dissertation in Sweden.", "C. A. R. Hoare": "\n\n- Sir Charles Antony Richard Hoare is a British computer scientist.\n- He has made contributions to programming languages, algorithms, operating systems, formal verification, and concurrent computing.\n- He developed the quicksort sorting algorithm and Hoare logic for verifying program correctness.\n- He introduced the CSP language for specifying interactions between concurrent processes and formulated the dining philosophers problem with Edsger Dijkstra.\n- He is credited with inventing and later criticizing the null pointer.\n- Since 1977, he has held positions at the University of Oxford and Microsoft Research in Cambridge.\n- Hoare's work earned him the Turing Award in 1980.\n- He has written several books, including Structured Programming and Communicating Sequential Processes.\n- Hoare is an Emeritus Professor at the University of Oxford and a principal researcher at Microsoft Research in Cambridge.\n- He is married to Jill Pym.", "C. J. van Rijsbergen": "\n\n- C. J. \"Keith\" van Rijsbergen is a professor of computer science at the University of Glasgow.\n- He is one of the pioneers of modern Information Retrieval.\n- He was born in Rotterdam and educated in multiple countries including Australia and the Netherlands.\n- He holds a degree in mathematics from the University of Western Australia and a PhD in computer science from the University of Cambridge.\n- He has held positions at Monash University, University College Dublin and Glasgow University.\n- He is the founder of the Glasgow Information Retrieval Group.\n- He is the author of two notable books: Information Retrieval and The Geometry of Information Retrieval.\n- He has received several awards and honors including being inducted as a Fellow of the Association for Computing Machinery, being awarded the Tony Kent Strix award and the Gerard Salton Award for Quantum haystacks.\n- He chaired the Scientific Board of the Information Retrieval Facility from 2007 to 2012.", "Carl Hewitt": "\n\n- Carl Eddie Hewitt was an American computer scientist.\n- He designed the Planner programming language for automated planning and the actor model of concurrent computation.\n- Planner was the first programming language based on procedural plans invoked using pattern-directed invocation from assertions and goals.\n- The actor model influenced the development of the Scheme programming language, the π-calculus, and served as an inspiration for several other programming languages.\n- Hewitt obtained his PhD in mathematics at MIT in 1971.\n- He was a faculty member of the MIT Department of Electrical Engineering and Computer Science and became emeritus in 2000.\n- Hewitt's work on inconsistency robustness provided practical rigorous foundations for systems dealing with pervasively inconsistent information.\n- Planner introduced the notion of the \"procedural embedding of knowledge\", an alternative to the logical approach to knowledge encoding for artificial intelligence pioneered by John McCarthy.\n- The actor model of computation was introduced in a 1973 paper authored by Hewitt, Peter Bishop, and Richard Steiger and has been a focus of Hewitt's work for over 30 years.\n- A number of programming languages were developed to specifically implement the actor model, such as ACT-1, SALSA, Caltrop, E, and ActorScript.\n- Hewitt's selected works include PLANNER: A Language for Proving Theorems in Robots IJCAI'69 and The Scientific Community Metaphor IEEE Transactions on Systems, Man, and Cybernetics.", "Carl Sassenrath": "- Carl Sassenrath is an architect of operating systems and computer languages\n- He brought multitasking to personal computers in 1985 with the creation of the Amiga Computer operating system kernel\n- He is the designer of the REBOL computer language, REBOL/IOS collaboration environment, the Safeworlds AltME private messaging system, and other products\n- Carl is currently a Principal Engineer at Roku, Inc.\n- He was born in California in 1957 and his family relocated to a small town of Eureka, California in the late 1960s\n- From his early childhood, he was actively involved in electronics, amateur radio, photography, and filmmaking\n- He graduated from the University of California, Davis in 1980 with a B.S. in EECS\n- During his time at Hewlett-Packard, he became interested in minimizing the high complexity found in most operating systems of that time and proposed his own concepts of a microkernel-based OS\n- In 1983, he joined Amiga Computer, Inc. and created a preemptive multitasking operating system within a microkernel design for the Amiga\n- In 1986, he was recruited to Apple Computer's Advanced Technology Group (ATG) to invent the next generation of operating systems\n- In 1996, he created REBOL, the relative expression-based object language, and founded REBOL Technologies in 1998\n- He currently lives in Ukiah, California and is interested in amateur radio, video production, quantum electrodynamics, and boating\n- He volunteers with the Television Improvement Association, a community organization that brings free, over-the-air television broadcasts into the Ukiah area.", "Carol Spradling": "\n\n- Carol Spradling is an American professor and computer scientist.\n- She served as the first Director of the School of Computer Science and Information Systems at Northwest Missouri State University.\n- Her work includes computer ethics, profession-based education, interactive media, and expanding the involvement of underrepresented groups and women in computing.\n- She taught computer science courses and served as a provost fellow and a liaison.\n- She co-founded the Missouri Iowa Nebraska Kansas Women in Computing Conference.\n- This conference gathers students, faculty, and technology leaders to address the decline of women in the computer science professions and discuss strategies for improving representation in the field.\n- She is active in the National Center for Women & Information Technology Academic Alliance.\n- She is the recipient of the 2012 Missouri Governor's Award for Excellence in Education and received the Dean's Faculty Award for Service in 2014.\n- She has published several articles related to computer science education and ethics.\n- She is associated with the Association for Computing Machinery's Council on Women in Computing (ACM-W) and the National Center for Women and Information Technology.", "Carroll Morgan (computer scientist)": "\n\n- Charles Carroll Morgan is an American computer scientist.\n- He moved to Australia as a teenager and completed his education there, including a Ph.D. from the University of Sydney.\n- During the 1980s and 1990s, he was based at the Oxford University Computing Laboratory in England as a researcher and lecturer in formal methods.\n- He authored Programming from Specifications, which combined high-level specification aspects of Z and rigorous computer program derivation methods of Edsger W. Dijkstra.\n- Together with Annabelle McIver, he later authored Abstraction, Refinement and Proof for Probabilistic Systems, pursuing the same themes for probabilistic programs.\n- Morgan is now a professor and Senior Principal Researcher at Trustworthy Systems at the University of New South Wales, and an Honorary Professor at Macquarie University, all in Australia.\n- His main research interests are probabilistic models for computer security and concurrency, and he is a proponent of the refinement calculus approach to program development.\n- He is involved with developing international standards in programming and informatics as an active member of several IFIP working groups, including IFIP Working Group 2.1 on Algorithmic Languages and Calculi.", "Cecilia Berdichevsky": "\n\n- Cecilia Berdichevsky was a pioneering Argentinian computer scientist.\n- She was born in Poland in 1925 and emigrated to Argentina as a child.\n- She began studying mathematics at the University of Buenos Aires at age 31 and had her first experience programming the Ferranti Mercury computer.\n- Berdichevsky studied computing from the visiting English software engineer Cicely Popplewell and returned home as an expert on the workings of the Mercury computer.\n- She worked as Head of Practical Works of Numerical Calculus I alongside her mentor, Manuel Sadosky.\n- Berdichevsky's work was disrupted by an Argentinian coup d'état that installed a military dictatorship.\n- She later became Deputy General Manager of the Argentine savings bank Caja de Ahorro in charge of its computer center.\n- Berdichevsky continued to work as a computer consultant and participated in important international projects and organizations.\n- She died in 2010 in Avellaneda, Argentina.\n- Berdichevsky published a paper in 2006 on the beginning of computer science in Argentina.", "Charles Bachman": "- Charles William Bachman III was an American computer scientist\n- He spent his entire career as an industrial researcher, developer, and manager rather than in academia\n- He was particularly known for his work in the early development of database management systems\n- His techniques of layered architecture include his namesake Bachman diagrams\n- Bachman was born in Manhattan, Kansas in 1924 and attended Michigan State College, where he graduated in 1948 with a bachelor's degree in mechanical engineering\n- He joined Dow Chemical in 1950 and became Dow's first data processing manager in 1957\n- In 1960, he joined General Electric and developed the Integrated Data Store (IDS), one of the first database management systems using the navigational database model\n- In 1983, Bachman founded Bachman Information Systems, which developed a line of computer-aided software engineering products, including the BACHMAN/Data Analyst\n- Bachman received the Turing Award from the Association for Computing Machinery (ACM) in 1973 and was elected as a Distinguished Fellow of the British Computer Society in 1977\n- He was awarded a National Medal of Technology and Innovation in 2012\n- Bachman papers from 1951 to 2007 are available from the Charles Babbage Institute at the University of Minnesota", "Charles E. Leiserson": "\n\n- Charles Eric Leiserson is a computer scientist specializing in parallel and distributed computing.\n- He developed the Cilk multithreaded language and the fat-tree interconnection network used in supercomputers.\n- He co-authored the standard algorithms textbook \"Introduction to Algorithms\" with Cormen, Rivest, and Stein.\n- He received his BS degree from Yale University and his PhD from Carnegie Mellon University.\n- He is a professor at MIT and a principal in the Theory of Computation research group.\n- He was Founder and chief technology officer of Cilk Arts, Inc., which was acquired by Intel in 2009.\n- He received multiple awards, including the 2014 Taylor L. Booth Education Award and the 2014 ACM-IEEE Computer Society Ken Kennedy Award.\n- He is a Fellow of ACM, AAAS, IEEE, and SIAM.\n- He received the 2013 ACM Paris Kanellakis Theory and Practice Award.\n- He has authored multiple editions of \"Introduction to Algorithms\" with Cormen, Rivest, and Stein.", "Charles Geschke": "-Charles Matthew Geschke was an American businessman and computer scientist\n-He co-founded Adobe Inc. with John Warnock in 1982 and co-created the PDF format with Warnock\n-Geschke earned an AB in classics and an MS in mathematics from Xavier University, and a PhD in computer science from Carnegie Mellon University\n-He worked at Xerox's Palo Alto Research Center before leaving to start Adobe with Warnock\n-Geschke served as Adobe's COO and president before retiring as president in 2000\n-In 1992, Geschke was kidnapped and held for four days before being released\n-He received numerous awards for his contributions to computer science, including the National Medal of Technology and Innovation in 2008\n-Geschke was involved in various organizations and served on boards, including the National Leadership Roundtable on Church Management and the San Francisco Symphony\n-He was a Catholic and received the St. Elizabeth Ann Seton Award from the National Catholic Educational Association with his wife in 2012\n-Geschke died on April 16, 2021, at the age of 81 from cancer.", "Charles H. Lindsey": "\n\n- Charles Hodgson Lindsey was a British computer scientist.\n- He was involved with ALGOL 68, an important programming language.\n- He edited the Revised Report on Algol 68 and co-wrote An Informal Introduction to Algol 68.\n- Lindsey was responsible for implementing ALGOL 68 on the experimental MU5 computer at Manchester University.\n- He wrote the complete History of ALGOL 68.\n- Lindsey was involved in developing international standards in programming as a member of IFIP Working Group 2.1.\n- He was a member of the Computer Conservation Society and part of the team restoring Douglas Hartree's Differential Analyser at Manchester Museum of Science and Technology.", "Charles H. Moore": "\n\n- Charles Havice Moore II is an American computer engineer and programmer born in 1938.\n- He is best known for inventing the Forth programming language in 1968.\n- Moore co-founded FORTH, Inc. with Elizabeth Rather in 1971.\n- In the 1980s, Moore designed several stack machine microprocessors and gained several microprocessor-related patents.\n- His designs emphasised high performance at low power usage.\n- In 2005, Moore co-founded IntellaSys, which develops and markets his chip designs.\n- He also developed the colorForth dialect of Forth, a language derived from the scripting language for his custom VLSI CAD system OKAD.\n- In 2009, he co-founded GreenArrays, Inc., which is marketing the GA4 and GA144 multi-computer chips.\n- Rather, Colburn and Moore's 1996 publication \"The Evolution of Forth\" is a significant source of information on Forth's development.\n- Moore's homepage, GreenArrays, FORTH, Inc., and an interview with Simple-Talk are linked in the article.", "Charles P. Thacker": "- Chuck Thacker was an American pioneer computer designer\n- He designed the Xerox Alto, the first computer to use a mouse-driven graphical user interface (GUI)\n- Thacker received his B.S. in physics from the University of California, Berkeley in 1967\n- He worked at Xerox Palo Alto Research Center, where he served as project leader of the Xerox Alto personal computer system, was co-inventor of the Ethernet LAN, and contributed to many other projects, including the first laser printer\n- Thacker also worked at Digital Equipment Corporation and Microsoft Research\n- He designed the hardware for Microsoft's Tablet PC, based on his experience with the interim Dynabook at PARC, and later the Lectrice, a pen-based hand-held computer at DEC SRC\n- Thacker died of complications from esophageal cancer on June 12, 2017\n- Thacker received several awards, including the Turing Award in 2010\n- Further reading and external links are available for those interested in learning more.", "Charles Stark Draper": "- Charles Stark \"Doc\" Draper was an American scientist and engineer\n- He was known as the \"father of inertial navigation\"\n- He founded the Massachusetts Institute of Technology's Instrumentation Laboratory, later renamed the Charles Stark Draper Laboratory, which designed the Apollo Guidance Computer for NASA\n- Draper attended the University of Missouri, Stanford University, and MIT, earning degrees in psychology, electrochemical engineering, and physics\n- He taught and conducted research at MIT until 1970, devoting most of his final decade to completing the Apollo computers and software\n- Draper received over 70 honors and awards, including the National Medal of Science and induction into the National Inventors Hall of Fame and National Aviation Hall of Fame\n- The Charles Stark Draper Prize, awarded annually and consisting of $500,000 in cash, a gold medallion, and a hand-inscribed certificate, was established in his honor by the National Academy of Engineering\n- Draper was a member of various professional associations, including the National Academy of Engineering and the American Physical Society, and served as president of the International Academy of Astronautics.", "Charlotte Froese Fischer": "\n\n- Charlotte Froese Fischer is an applied mathematician and computer scientist.\n- She developed and implemented the Multi-Configurational Hartree-Fock (MCHF) approach to atomic-structure calculations.\n- Her research on atomic structure led to the experimental discovery of the negative ion of calcium, the first known anion of a Group 2 element.\n- She was elected a Fellow of the American Physical Society in part for her contribution to this discovery.\n- Froese Fischer was born in Ukraine to parents of Mennonite descent, who immigrated to Canada when she was a child.\n- She obtained her Ph.D. in Applied Mathematics and Computing at Cambridge University in 1957, with coursework in quantum theory under Paul Dirac.\n- Froese Fischer spent most of her career at the University of British Columbia and Vanderbilt University.\n- She authored over 300 research articles on computational atomic theory.\n- One of her largest efforts was the calculation of the complete lower spectra of the beryllium-like to argon-like isoelectronic sequences, covering over 150 ions.\n- Her contributions to the field have received numerous accolades, including honors from the American Physical Society, Royal Physiographic Society, and Lithuanian Academy of Sciences.", "Chris Lattner": "\n\n-Christopher Arthur Lattner is an American software engineer, born in 1978.\n\n-He is the co-founder and CEO at Modular AI, an artificial intelligence platform for developers.\n\n-Lattner studied computer science at the University of Portland, graduating with a Bachelor of Science degree in 2000.\n\n-He has worked at SiFive, Google, Tesla, Inc., and Apple Inc.\n\n-At SiFive, Lattner led the RISC-V Product and Engineering organizations.\n\n-At Google, Lattner served as the Senior Director and Distinguished Engineer, TensorFlow Infrastructure and Technologies.\n\n-Lattner served as the Vice President at Autopilot Software at Tesla, Inc., primarily responsible for creating Swift.\n\n-At Apple Inc., Lattner was the Senior Director and Architect, Developer Tools Department, responsible for the Xcode IDE Instruments performance analysis tool, Apple Java releases, and a variety of internal tools.\n\n-Lattner designed and began implementing LLVM, an innovative infrastructure for optimizing compilers, while working with Vikram Adve at the University of Illinois at Urbana-Champaign.\n\n-Lattner also created the Swift programming language.\n\n-Lattner is the co-founder of the MLIR compiler infrastructure.\n\n-He is married to Tanya Lattner, a co-founder, president, and chief operating officer (COO) of the LLVM Foundation since 2015.", "Chris McKinstry": "- Kenneth Christopher McKinstry was a Canadian artificial intelligence researcher\n- He led the MISTIC project and founded the Mindpixel project\n- McKinstry struggled with bipolar disorder and had a history of suicidal thoughts\n- He died by suicide in 2006, leaving behind an online suicide note\n- McKinstry's work has been published posthumously in Psychological Science\n- McKinstry is the subject of a 2010 documentary called The Man Behind the Curtain\n- He had a failed online soap opera called CR6, leaving many creditors with unpaid debts", "Christopher J. Date": "\n\n- Chris Date is an independent author, lecturer, researcher, and consultant.\n- He specializes in relational database theory.\n- He attended High Wycombe Royal Grammar School and received his BA in Mathematics from Cambridge University in 1962.\n- He worked at Leo Computers Ltd. and IBM Hursley as a computer programming instructor and was involved in technical planning and design for IBM products SQL/DS and DB2.\n- He left IBM in 1983 and has written extensively on the relational model, in association with Hugh Darwen.\n- His book \"An Introduction to Database Systems\" has sold over 700,000 copies and is used by several hundred colleges and universities worldwide.\n- Some of his other works include \"Databases, Types, and the Relational Model\", \"Database in Depth: Relational Theory for Practitioners\", and \"SQL and Relational Theory\".\n- He has published articles with Fabian Pascal at Database Debunkings.", "Christopher Riche Evans": "- Christopher Riche Evans was a British psychologist, computer scientist, and author.\n- He was born in Aberdyfi, Wales and educated at Christ College, Brecon.\n- Evans worked as a science journalist and writer before pursuing a B.A. in Psychology at University College London.\n- He worked on eye movements at the Physics Laboratory, University of Reading, and later at the Division of Computer Science, National Physical Laboratory, Teddington.\n- Evans wrote a book about the oncoming microcomputer revolution, The Mighty Micro: The Impact of the Computer Revolution, and scripted and presented a televised series on the topic.\n- He also wrote Cults of Unreason, a study of pseudoscience, and Landscapes of the Night: How and Why We Dream, as well as edited several anthologies and reference books.\n- Evans had a significant friendship and collaboration with writer J.G. Ballard.\n- He died of cancer in 1979 at the age of 48.", "Christopher Strachey": "- Christopher S. Strachey was a British computer scientist who contributed to denotational semantics and programming language design.\n- He is credited as possibly being the first developer of a video game, creating a version of draughts.\n- Strachey was born into the Strachey family, which was prominent in government, arts, administration, and academia.\n- He studied at Cambridge but suffered a nervous breakdown and did not perform well.\n- He worked at Standard Telephones and Cables (STC) as a research physicist and later became a schoolteacher before joining the National Physical Laboratory (NPL).\n- Strachey developed the concept of time-sharing in computing, filed patents for computer design, and worked on programming language design.\n- He later became a computer consultant and worked on various projects for organizations such as NRDC, EMI, and Ferranti.\n- Strachey became a distinguished fellow of the British Computer Society in 1971.\n- He died of infectious hepatitis in 1975.\n- The Department of Computer Science at the University of Oxford has a Christopher Strachey Professorship of Computing and an archive of his papers is held in the Bodleian Library.", "Christos Papadimitriou": "\n\n- Christos Charilaos Papadimitriou is a Greek theoretical computer scientist.\n- He received his Bachelor of Arts degree in electrical engineering from the National Technical University of Athens in 1972.\n- Papadimitriou completed his Ph.D. in electrical engineering and computer science from Princeton University in 1976.\n- Papadimitriou has taught at several universities and is currently the Donovan Family Professor of Computer Science at Columbia University.\n- He co-authored a paper on pancake sorting with Bill Gates when Gates was a Harvard undergraduate.\n- Papadimitriou received many honors and awards, including the IEEE John von Neumann Medal, the EATCS Award, the Gödel Prize, and the Knuth Prize.\n- His publications include textbooks Computational Complexity and Algorithms, as well as the graphic novel Logicomix.\n- Papadimitriou joined a professor-and-graduate-student band called Lady X and The Positive Eigenvalues at UC Berkeley in 2006.\n- He has received several honorary doctorate degrees.\n- Papadimitriou's name is listed in the 19th position on the CiteSeer search engine academic database and digital library.", "Cicely Popplewell": "\n\n- Cicely Mary Williams was a British software engineer born in 1920.\n- She studied the Mathematical Tripos at the University of Cambridge.\n- In 1943, she joined the Women's Engineering Society and became a Technical Assistant at Rolls-Royce Ltd.\n- In 1949, she joined Alan Turing in the Computer Machine Learning department at the University of Manchester.\n- She worked on the programming of the Manchester Mark 1 and wrote the Programmers Handbook for the Ferranti Mark 1 in 1951.\n- She also taught the first ever programming class in Argentina at the University of Buenos Aires in 1961.\n- After leaving the University of Manchester Computing Service in the late 1960s, she married George Keith Williams and died in 1995 in Buxton, England.", "Claude Sammut": "\n\n- Claude Sammut is a professor of computer science and engineering at the University of New South Wales and Head of the Artificial Intelligence Research Group.\n- He was the UNSW node Director of the ARC Centre of Excellence for Autonomous Systems (CAS) and a program manager for the Smart Internet Technology CRC.\n- His early work on relational learning helped to lay the foundations for the field of inductive logic programming (ILP).\n- His current interests include conversational agents and robotics, and he has won RoboCup competitions with UNSW teams.\n- He is a member of the editorial boards of the Journal of Machine Learning Research, the Machine Learning journal and New Generation Computing.\n- He has been involved in RoboCup since 1999 and was appointed as a Trustee of RoboCup in 2012.\n- His research interests include machine learning, robotics, user interfaces, software, and applications.", "Cleve Moler": "\n\n- Cleve Barry Moler is an American mathematician and computer programmer specializing in numerical analysis.\n- Moler co-authored LINPACK and EISPACK, Fortran libraries for numerical computing, in the mid to late 1970s.\n- He invented MATLAB, a numerical computing package, to give his students at the University of New Mexico easy access to these libraries without writing Fortran.\n- In 1984, he co-founded MathWorks with Jack Little to commercialize this program.\n- Moler received his bachelor's degree from California Institute of Technology and a Ph.D. from Stanford University.\n- He is a professor of mathematics and computer science for almost 20 years at the University of Michigan, Stanford University, and the University of New Mexico.\n- Moler is a member of the Association for Computing Machinery and was president of the Society for Industrial and Applied Mathematics from 2007 to 2008.\n- He has authored four textbooks on numerical methods and has been recognized with honorary degrees and awards for his contributions to numerical analysis and software, including the invention of MATLAB.\n- Moler was elected a member of the National Academy of Engineering on February 14, 1997.\n- In April 2017, he was made a Fellow of the Computer History Museum.\n- Publications include \"Computer methods for mathematical computations\" and \"Numerical Computing with MATLAB\".", "Cliff Jones (computer scientist)": "\n\n- Clifford \"Cliff\" B. Jones is a British computer scientist.\n- He specializes in research into formal methods.\n- He proposed an extension to Hoare logic for handling concurrent programs, rely/guarantee, in his DPhil thesis at Oxford University Computing Laboratory.\n- He worked for IBM, where he contributed to the development of the Vienna Development Method (VDM).\n- He was a professor at the Victoria University of Manchester.\n- He also worked in the industry at Harlequin for a period and is now a Professor of Computing Science at Newcastle University.\n- He has been the editor-in-chief of the Formal Aspects of Computing journal.\n- He has authored and edited many books, including Understanding Programming Languages, VDM: Une methode rigoureuse pour le development du logiciel, and Systematic Software Development using VDM.\n- Jones is also interested in interdisciplinary aspects of computer science and the history of computer science.", "Cliff Shaw": "\n\n- John Clifford Shaw was a systems programmer at the RAND Corporation.\n- He coauthored the first artificial intelligence program, the Logic Theorist.\n- He helped develop General Problem Solver and Information Processing Language.\n- Shaw is considered the true \"father\" of the JOSS language.\n- He worked with Allen Newell and Herbert A. Simon on the concept of list processing.\n- Shaw invented the linked list, which is fundamental in modern computing technology.", "Colette Rolland": "- Colette Rolland is a French computer scientist and a Professor of Computer Science at the University of Paris 1 Pantheon-Sorbonne.\n- She is a leading researcher in the area of information and knowledge systems, with a focus on meta-modeling, goal modeling, and situational method engineering.\n- Rolland studied applied mathematics at the University of Nancy and received her PhD in 1971.\n- In 1973, she was appointed Professor at the University of Nancy, Department of Computer Science, and in 1979, she became Professor at the University of Paris 1 Pantheon-Sorbonne, Department of Mathematics and Informatics.\n- She has been involved in many European research and cooperative projects with companies.\n- Rolland is on the editorial board of several journals and the French representative in IFIP TC8 on Information Systems.\n- She has been awarded several prizes, including the IFIP Silver Core, IFIP service award, and the European prize of ‘Information Systems’.\n- Rolland's research interests include information modeling, databases, temporal data modeling, object-oriented analysis and design, requirements engineering, and change engineering, among others.\n- She has co-authored seven textbooks and authored or co-authored over 280 papers and edited 25 proceedings.", "Cornelis H. A. Koster": "\n\n- Cornelis Hermanus Antonius Koster was a Dutch computer scientist and professor.\n- He was born in Haarlem and moved to Jakarta after the war, but returned to the Netherlands at the age of 11.\n- Koster worked at the Mathematisch Centrum in Amsterdam under Adriaan van Wijngaarden and was one of the editors of the original Report on the Algorithmic Language ALGOL 68.\n- He became involved in developing international standards in programming and informatics as a member of IFIP Working Group 2.1 on Algorithmic Languages and Calculi.\n- Koster created the original Compiler Description Language (CDL) and affix grammars, a variant of Van Wijngaarden grammars.\n- He initiated an informatics course at the Technical University of Berlin in 1972 and became the first Professor of Informatics at Radboud University Nijmegen in 1977.\n- Koster died in a motorcycle accident in 2013.", "Corrado Böhm": "\n\n- Corrado Böhm was a Professor Emeritus at the University of Rome \"La Sapienza\" and a computer scientist.\n- He made contributions to the theory of structured programming, constructive mathematics, combinatory logic, lambda calculus, and functional programming languages.\n- In his PhD dissertation, he described a full meta-circular compiler for the first time.\n- He co-authored the structured program theorem with Giuseppe Jacopini in 1966.\n- He demonstrated the Böhm-Berarducci encoding which established an isomorphism between strictly-positive algebraic data types and polymorphic lambda-terms.\n- He established Böhm's theorem, which is an important separation theorem between normal forms in the lambda calculus.\n- He received the 2001 EATCS Award for a distinguished career in theoretical computer science.\n- He published a number of influential articles, including \"Functional Programming and Combinatory algebras\".", "D. R. Fulkerson": "\n\n- Delbert Ray Fulkerson was an American mathematician.\n- He co-developed the Ford-Fulkerson algorithm in 1956 with L.R. Ford Jr.\n- This algorithm is used to solve the maximum flow problem in networks.\n- Fulkerson was born in Tamms, Illinois and studied at Southern Illinois University.\n- He served in World War II before returning to complete his degree and later obtaining a Ph.D. in mathematics at the University of Wisconsin-Madison.\n- Fulkerson worked at the RAND Corporation and later at Cornell University as the Maxwell Upson Professor of Engineering.\n- He was diagnosed with Crohn's disease and committed suicide in 1976.\n- The Fulkerson Prize for outstanding papers in discrete mathematics was established in 1979 in his honor.\n- Fulkerson also supervised the work of Jon Folkman at RAND and Tatsuo Oyama at GRIPS.\n- See also: Out-of-kilter algorithm, List of people diagnosed with Crohn's disease.", "DJ Patil": "\n\n- Dhanurjay Patil, also known as DJ Patil, is an American mathematician and computer scientist.\n- He was the Chief Data Scientist of the United States Office of Science and Technology Policy from 2015 to 2017.\n- He is currently the Head of Technology for Devoted Health.\n- Patil has worked at LinkedIn, Greylock Partners, Skype, PayPal, and eBay.\n- In 2004, he worked in the Department of Defense on the Threat Anticipation Project.\n- He has written two books: \"Building Data Science Teams\" and \"Data Jujitsu -- The Art of Turning Data into Product.\"\n- Patil helped launch the White House's Police Data Initiative and the White House's Data-Driven Justice Initiative.\n- The Police Data Initiative aimed to build trust between the police and their communities by releasing data sets on police actions, and the Data-Driven Justice Initiative aimed to filter low-risk and low-level offenders from the criminal system.\n- Patil supported the Precision Medicine Initiative, aimed at building the largest database of genomic information to improve medical treatments.\n- In 2017, Patil joined Devoted Health and Venrock.", "Dan Ingalls": "- Daniel Henry Holmes Ingalls Jr. is a pioneer in object-oriented computer programming and the principal architect of five generations of Smalltalk environments.\n- Ingalls designed the bytecoded virtual machine that made Smalltalk practical in 1976, invented bit blit, which underlies most bitmap computer graphics systems today, and pop-up menus.\n- Ingalls has made major contributions to the Squeak version of Smalltalk, including developing the original concept of a Smalltalk written in itself and made portable and efficient by a Smalltalk-to-C translator.\n- Ingalls received a B.A. in physics from Harvard University and an M.S. in electrical engineering from Stanford University but did not complete his Ph.D. at Stanford as he started a company to sell a software measurement invention he perfected.\n- Ingalls received several awards, including the ACM Grace Murray Hopper Award for Outstanding Young Scientist in 1984 and the ACM Software System Award in 1987 for his work on Smalltalk.\n- In addition to his work on Smalltalk, Ingalls also developed an optical character recognition system for Devanagari writing in collaboration with his father, a professor of Sanskrit.\n- Ingalls currently consults and lives in Manhattan Beach, California, with his wife.\n- Ingalls' most recent project is a JavaScript environment named Lively Kernel, which allows live, interactive web programming and objects from inside web browsers.", "Dan Jurafsky": "- Daniel Jurafsky is a professor of linguistics and computer science at Stanford University\n- He is known for developing the first automatic system for semantic role labeling (SRL) with Daniel Gildea\n- Jurafsky is the author of The Language of Food: A Linguist Reads the Menu and a textbook on speech and language processing\n- He received his B.A in linguistics and Ph.D. in computer science, both from UC Berkeley, and a postdoc at ICSI, Berkeley\n- Jurafsky received a MacArthur Fellowship in 2002 and other honors and awards, including being a LSA Fellow and receiving the Atkinson Prizes in Psychological and Cognitive Sciences\n- He lives in San Francisco, California.", "Dana Scott": "\n\n- Dana Stewart Scott is an American logician and university professor.\n- He earned his B.A. in Mathematics from the University of California, Berkeley and his Ph.D. from Princeton under Alonzo Church.\n- He is best known for his contributions to automata theory, modal logic, topology, and category theory.\n- He introduced the idea of nondeterministic machines to automata theory and, together with Michael O. Rabin, received the Turing Award in 1976 for this work.\n- He worked at the University of California, Berkeley, the University of Chicago, the University of Oxford, and Carnegie Mellon University.\n- He collaborated with Christopher Strachey to provide a mathematical foundation for the semantics of programming languages, which became the Scott-Strachey approach to denotational semantics.\n- His contributions to theoretical computer science led to numerous awards, including the 1997 Rolf Schock Prize in logic and philosophy and the 2007 EATCS Award.\n- He proposed the theory of equilogical spaces as a successor theory to domain theory.\n- His publications include \"Finite Automata and Their Decision Problem,\" \"An Introduction to Modal Logic,\" and \"Continuous Lattices and Domains.\"", "Danese Cooper": "- Danese Cooper is an American programmer and computer scientist\n- She has managed teams at Symantec and Apple Inc\n- Cooper served as chief open source \"evangelist\" for six years at Sun Microsystems before moving on to senior director for open source strategies at Intel\n- She is a board member of the Open Source Hardware Association and a board observer at Mozilla\n- In February 2010 Cooper was appointed Chief Technical Officer of the Wikimedia Foundation but left in July 2011\n- Cooper is the founder and chair of the InnerSource Commons Foundation\n- She started a consultancy, daneseWorks, in June 2011\n- Cooper obtained her high school diploma from Chadwick School and her B.A. from the University of California, Los Angeles and spent time in Morocco as a volunteer in the Peace Corps.", "Daniel J. Bernstein": "- Daniel Julius Bernstein is a mathematician, cryptologist, and computer scientist\n- He is a visiting professor at CASA at Ruhr University Bochum and a research professor of Computer Science at the University of Illinois at Chicago. \n- He used to be a professor in the department of mathematics and computer science at the Eindhoven University of Technology.\n- Bernstein brought the court case Bernstein v. United States, which declared that software was protected speech under the First Amendment and contributed to regulatory changes reducing controls on encryption.\n- Bernstein designed the Salsa20 and ChaCha20 stream ciphers along with the elliptic curve Curve25519 and worked as the lead researcher on the Ed25519 version of EdDSA, which made their way into popular software.\n- Bernstein has written multiple security-aware programs, including qmail, ezmlm, djbdns, ucspi-tcp, daemontools, and publicfile.\n- He proposed Internet Mail 2000, an alternative system for electronic mail, intended to replace the Simple Mail Transfer Protocol (SMTP), the Post Office Protocol (POP3) and the Internet Message Access Protocol (IMAP)\n- Bernstein has published numerous papers on mathematics and computation, including proposing the use of a twisted Edwards curve, Curve25519, as a basis for elliptic curve cryptography.\n- In 2004, Bernstein taught a course on computer software security where he assigned each student to find ten vulnerabilities in published software.", "Daniel P. Friedman": "\n\n- Daniel Paul Friedman is a professor of Computer Science at Indiana University in Bloomington\n- His research focuses on programming languages and he is a prominent author in the field\n- He wrote a highly influential paper on lazy programming with David Wise, exploring a programming style with potentially infinite data structures and no computational effects\n- In the 1980s, he focused on studying the Scheme programming language and explored the use of macros\n- He is a prolific textbook author, writing several \"little\" books, including The Little Schemer, which is still in its fourth edition\n- He is also the lead author of Essentials of Programming Languages, a widely used textbook on programming languages\n- Recently, he has resumed work on his \"Little\" series with The Reasoned Schemer and The Little Prover\n- He has authored or co-authored several books, including Coordinated Computing: Tools and Techniques for Distributed Software and The Little Typer\n- His work has had a significant impact on the study of programming languages, including the use of operational semantics and type theory in textbooks.", "Daniel Siewiorek": "\n\n- Daniel P. Siewiorek is an American computer engineer and computer scientist.\n- He is currently the Buhl University Professor Emeritus of Electrical and Computer Engineering and Computer Science at Carnegie Mellon University.\n- His research focuses on electronic design automation, reliability computing, and context aware mobile computing.\n- He has designed or been involved with the design of nine multiprocessor systems, and contributed to the dependability design of over two dozen commercial computing systems.\n- He has written nine textbooks and over 475 papers.\n- He served as Director of Carnegie Mellon University's Quality of Life Technology NSF Engineering Research Center and Department Head of the Human Computer Interaction Institute.\n- He was the former Chairman of the IEEE Technical Committee on Fault-Tolerant Computing and founding Chairman of the IEEE Technical Committee on Wearable Information Systems.\n- He is the recipient of the AAEE Terman Award, the IEEE/ACM Eckert–Mauchly Award, and the ACM SIGMOBILE Outstanding Contributions Award.\n- He was awarded the IEEE Computer Society Taylor L. Booth Education Award in February 2018.\n- He is a Fellow of IEEE, ACM, and AAAS, and was elected to the National Academy of Engineering in 2000.\n- He received his B.A. from the University of Michigan and his M.A. and Ph.D. from Stanford University, all in Electrical Engineering.", "Daniel Sleator": "\n\n- Daniel Dominic Kaplan Sleator is a Professor of Computer Science at Carnegie Mellon University.\n- He won the ACM Paris Kanellakis Award in 1999 for the splay tree data structure.\n- Sleator was a pioneer in amortized analysis of algorithms, and he developed many data structures with Robert Tarjan.\n- He invented link/cut trees, splay trees, and skew heaps.\n- He developed the theory of link grammars and the Serioso music analyzer.\n- Sleator's paper on the move-to-front heuristic suggested the idea of competitive analysis.\n- He commercialized the Internet Chess Server into the Internet Chess Club.\n- He is the younger brother of William Sleator, a science fiction writer.\n- From 2003 to 2008, he co-hosted the talk show Left Out on WRCT-FM.\n- He is an active member of the competitive programming platform Codeforces.", "Daniel Thalmann": "- Prof. Daniel Thalmann is a Swiss and Canadian computer scientist and a pioneer in virtual humans.\n- He is currently an Honorary Professor at EPFL, Switzerland and Director of Research Development at MIRALab Sarl in Geneva, Switzerland.\n- Thalmann earned a PhD in Computer Science from the University of Geneva in 1977 and was a Professor at the University of Montreal from 1977 to 1989.\n- He founded the virtual reality lab (VRlab) at EPFL, Switzerland and has been a Visiting Professor/ Researcher at several universities worldwide.\n- Thalmann has published more than 650 papers in graphics, animation, and virtual reality and is the co-editor-in-chief of the Journal of Computer Animation and Virtual Worlds.\n- His research focuses on realistic computer modelling and rendering of the human form, in motion, as well as behavioural animation of virtual humans and crowd simulation.\n- Thalmann coined the term Virtual Rehabilitation with Professor Grigore Burdea of Rutgers University and is a founder of the International Society of Virtual Rehabilitation.\n- He has received several awards and honors, including the Eurographics Distinguished Career Award in 2010 and the 2015 CGI Career Achievement Award.\n- Thalmann directed the short film Rendez-vous in Montreal, which is widely regarded as the first computer film to employ synthetic actors.", "Darrell Long": "\n\n- Darrell Don Earl Long is a computer scientist and computer engineer.\n- He is the Kumar Malavalli Endowed Chair of Storage Systems Research and Distinguished Professor of Engineering at the University of California, Santa Cruz.\n- Long was the founder of the Conference on File and Storage Technologies in 2002.\n- He did his undergraduate studies at San Diego State University and received his Ph.D. from the University of California, San Diego.\n- Long's research interests include computer data storage, operating systems, distributed computing, and computer security.\n- He has worked on metadata for exascale file systems, data deduplication, and web caching.\n- Long is a fellow of both the IEEE and the American Association for the Advancement of Science.", "David A. Bader": "- David A. Bader is a Distinguished Professor and Director of the Institute for Data Science at the New Jersey Institute of Technology.\n- He previously served as the Chair of the Georgia Institute of Technology School of Computational Science & Engineering and the executive director of High-Performance Computing at the Georgia Tech College of Computing.\n- Bader is an expert in the design and analysis of parallel and multicore algorithms for real-world applications such as those in cybersecurity and computational biology.\n- His main areas of research are at the intersection of high-performance computing and real-world applications, including cybersecurity, massive-scale analytics, and computational genomics.\n- Bader built the first Linux supercomputer using commodity processors and a high-speed interconnection network.\n- Bader has received awards from IBM, Microsoft Research, Nvidia, Facebook, Intel, Accenture, and Sony.\n- Bader is an IEEE Fellow, an AAAS Fellow, SIAM Fellow, and an ACM Fellow.\n- Bader has served on numerous conference program committees related to parallel processing and has edited numerous journals.\n- In 2019, Bader joined the New Jersey Institute of Technology as a Distinguished Professor in the Ying Wu College of Computing Sciences and was named the first director of the school's new Institute for Data Science.\n- Bader is credited with the development of the first Linux supercomputer using commodity parts.\n- Bader has one child, Sadie \"Sage\" Rose, who is an avid artist.", "David A. Wagner": "\n\n- David A. Wagner is a professor of computer science at the University of California, Berkeley\n- He is a well-known researcher in cryptography and computer security\n- Wagner is a member of the Election Assistance Commission's Technical Guidelines Development Committee and the ACCURATE project\n- He received an A.B. in mathematics and a Ph.D. in computer science from Berkeley\n- Wagner has published two books and over 90 peer-reviewed scientific papers\n- Wagner served as a principal investigator for the source code review and documentation review of the California state Top-to-Bottom review of electronic voting systems certified for use\n- He has made notable achievements in cryptanalysis, including the discovery of flaws in WEP, A5/1, and Microsoft's PPTP tunnelling protocol\n- Wagner was involved in the development of the Twofish block cipher, which was a finalist for NIST's Advanced Encryption Standard competition\n- He also discovered a flaw in the implementation of SSL in Netscape Navigator in 1995.", "David Blei": "\n\n- David Meir Blei is a professor at Columbia University in the Statistics and Computer Science departments.\n- He was previously an associate professor at Princeton University.\n- His research interests are primarily in machine learning, particularly in topic models.\n- Blei was involved in the development of latent Dirichlet allocation, along with Andrew Ng and Michael I. Jordan.\n- As of June 2020, his publications have been cited 109,821 times with an h-index of 97.\n- Blei received the ACM Infosys Foundation Award in 2013 for computer scientists under the age of 45.\n- He was named Fellow of ACM in 2015 for his contributions to probabilistic topic modeling and Bayesian machine learning.", "David C. Evans": "\n\n- David Cannon Evans was the founder of the computer science department at the University of Utah and co-founder of Evans & Sutherland, a computer graphics hardware company.\n- He earned his Bachelor of Science in Physics and Doctorate in Physics from the University of Utah.\n- Evans worked at Bendix aviation electronics company as a project manager where he developed an early personal computer called Bendix G-15.\n- He became a faculty member at the University of California, Berkeley where he did several experiments on an IDIOM display hooked up to a Digital Equipment Corporation PDP-5.\n- In 1963, he was co-Principal Investigator for project Genie to produce an early multi-user timesharing system, which included key developments in virtual memory.\n- He was a member of the Church of Jesus Christ of Latter-day Saints and was awarded the Silver Beaver for his role in scouting.\n- His students at the University of Utah included Alan Kay, Edwin Catmull, John Warnock, and Henri Gouraud.\n- Brigham Young University established the David C. Evans Chair of Computer Engineering and Graphics in his honor.\n- Evans had ten children, only seven of which lived to adulthood, and passed away in 1998 due to Alzheimer's disease.", "David Canfield Smith": "\n\n- David Canfield Smith is a computer scientist known for inventing computer icons and programming by demonstration.\n- His primary focus has been on human-com", "David F. Bacon": "\n\n- David Bacon is an American computer programmer.\n- He began working as a programmer at age 16 and worked for a startup during his senior year of high school.\n- At Columbia College, he worked on the NON-VON supercomputer and then on network algorithms and simulation.\n- He spent most of his career at IBM's Thomas J. Watson Research Center, where he worked on garbage collection and became a Principal Research Staff Member.\n- He was inducted as an ACM Fellow for contributions to real-time systems and to object-oriented language design and implementation.\n- His work on garbage collection has been used in various programming languages, including PHP.\n- He joined Google in 2014 and is currently a Principal Engineer working on the Spanner distributed database system.", "David Gelernter": "\n\n- David Hillel Gelernter is an American computer scientist, artist, and writer.\n- He is a professor of computer science at Yale University.\n- Gelernter made seminal contributions to the field of parallel computation in the 1980s, specifically the tuple space coordination model, as embodied by the Linda programming system he and Nicholas Carriero designed.\n- Gelernter is also known for his views on topics such as computed worlds and his belief that liberal academia and women in the workforce have a destructive influence on American society.\n- He is a former national fellow at the American Enterprise Institute and senior fellow in Jewish thought at the Shalem Center.\n- Gelernter has written several books, including Americanism: The Fourth Great Western Religion and America-Lite: How Imperial Academia Dismantled Our Culture (and Ushered in the Obamacrats).\n- In 1993, Gelernter was almost killed by a mail bomb sent by the Unabomber, leaving him with permanent loss of use of his right hand and damage to his right eye.\n- Gelernter's paintings have been exhibited, sold, stolen, and recovered in New Haven and Manhattan.\n- Gelernter has rejected the scientific consensus regarding anthropogenic climate change and evolution.\n- He has contributed to magazines such as City Journal, The Weekly Standard, and Commentary, and has published in The Wall Street Journal, the New York Post, the Los Angeles Times, and the Frankfurter Allgemeine Zeitung.", "David H. D. Warren": "\n\n- David H. D. Warren is a computer scientist.\n- He worked on logic programming, particularly Prolog in the 1970s and 1980s.\n- Warren wrote the first compiler for Prolog.\n- The Warren Abstract Machine execution environment for Prolog is named after him.\n- He received a Ph.D. in artificial intelligence from the University of Edinburgh in 1977.\n- Warren worked for the Artificial Intelligence Center at SRI International in the 1980s.\n- He founded Quintus Computer Systems in 1983 with others to commercialize the Prolog compiler.\n- Quintus was sold to Intergraph Corporation in 1989.\n- Warren also worked at the University of Bristol Department of Computer Science.", "David J. Brown (computer scientist)": "- David James Brown is an American computer scientist.\n- He helped develop the SUN workstation system at Stanford University, which later resulted in Sun Microsystems.\n- He was a co-founder of Silicon Graphics in 1982.\n- Brown studied at the University of Pennsylvania, Moore School of Electrical Engineering, and received a B.S.E. degree in 1979 and an M.S.E. in 1980.\n- He pursued a Ph.D. degree at the University of Cambridge, England, and his dissertation introduced the concept of Unified Memory Architecture.\n- Brown worked for Digital Equipment Corporation and helped build the group responsible for introducing the DECstation line of computer systems.\n- He joined Sun Microsystems in 1992 and helped establish the process for the company's system software architecture.\n- Brown later worked on Solaris's adoption of open-source software and technologies for energy-efficient computing.\n- He was elected to the Council of the Association for Computing Machinery in 1998 and became a founding editor of the ACM Queue magazine in 2003.", "David Korn (computer scientist)": "\n\n- David G. Korn is an American UNIX programmer.\n- He is the author of the Korn shell (ksh), a command line interface/programming language.\n- Korn received his Ph.D. in applied mathematics from NYU's Courant Institute of Mathematical Sciences.\n- He worked at Bell Laboratories in 1976 and developed Korn shell in response to problems with Bourne shell and C shell.\n- The Korn shell was backward-compatible with Bourne shell and incorporated a choice of editing styles.\n- Microsoft once included a version of the Korn shell produced by Mortice Kern Systems (MKS) in a UNIX integration package for Windows NT.\n- Korn is also known as the creator of UWIN, an X/Open library for Win32 systems, and sfio, a library for managing I/O streams.\n- He became a Bell Labs fellow in 1984 and worked for AT&T Labs Research until 2013.\n- Korn retired from Google in early February 2018.\n- His parents were Florence and Nathaniel Korn, and he married Susan Lyn Weiner in 1967.\n- Korn's son Adam used to work at Goldman Sachs.", "David Liddle": "\n\n- David Liddle is a co-founder of Interval Research Corporation and a consulting professor of computer science at Stanford University.\n\n- He played a leading role in the development of the Xerox Star computer system while working at Xerox PARC.\n\n- In 1982 he co-founded Metaphor Computer Systems.\n\n- He has served on the board of many corporations.\n\n- Liddle was also the chair of the board of trustees of the Santa Fe Institute from 1994 to 1999.\n\n- He has a B.S. in computer science from the University of Michigan and a Ph.D. in EECS from the University of Toledo.\n\n- In January 2012, he joined the board of directors of SRI International.", "David P. Anderson": "\n\n- David Pope Anderson is an American research scientist and adjunct professor of computer science.\n- He leads the SETI@home, BOINC, Bossa, and Bolt software projects.\n- Anderson received a BA in mathematics and MS and PhD degrees in mathematics and computer science.\n- He invented \"Virtual Reality Television\" and received a patent for it in 1996.\n- Anderson created the Berkeley Open Infrastructure for Network Computing project in 2002.\n- BOINC is used by about 100 projects, including SETI@home, Einstein@home, and Climateprediction.net.\n- Anderson was involved in Stardust@home, Bossa, and Bolt. \n- The Berkeley Open System for Skill Aggregation (BOSSA) is a software framework for distributed thinking.", "David P. Reed": "\n\n- David Patrick Reed is a computer scientist from the US.\n- He was educated at MIT and has made significant contributions to computer networking and wireless communications networks.\n- He was involved in early development of TCP/IP and designed the User Datagram Protocol (UDP).\n- Reed is one of the authors of the paper \"End-to-End arguments in system design\".\n- He is known for Reed's Law, which asserts that social networks can scale exponentially with size.\n- From 2003 to 2010, he was an adjunct professor at MIT and co-led the Viral Communications group and Communication Futures program.\n- He is currently a senior vice president at SAP Labs and on the advisory board of TTI/Vanguard.\n- His 1978 dissertation introduced multiversion concurrency control (MVCC), a method for concurrent access to databases and transactional memory.", "David Park (computer scientist)": "\n\n- David Michael Ritchie Park is a British computer scientist.\n- He worked on the first implementation of the programming language Lisp.\n- He focused on topics such as fairness, program schemas and bisimulation in concurrent computing.\n- He was one of the earliest members of the computer science department at the University of Warwick.\n- He served as chairperson at the University of Warwick.\n- He died on September 29, 1990.\n- More information is available on the Mathematics Genealogy Project website.", "David Parnas": "\n\n- David Lorge Parnas is a Canadian pioneer of software engineering.\n- He developed the concept of information hiding in modular programming.\n- He earned his PhD in electrical engineering at Carnegie Mellon University.\n- Parnas taught at various universities including University of North Carolina, Technische Universität Darmstadt, and Queen's University.\n- Parnas received various awards and honors for his work, including ACM \"Best Paper\" award and fellowships in several organizations.\n- He is a proponent of precise documentation and ethics in software engineering.\n- Parnas took a stand against the US Strategic Defense Initiative and advocated for professionalization of software engineering.\n- He criticized the number-of-publications-based approach towards ranking academic production.\n- His seminal paper \"On the Criteria to Be Used in Decomposing Systems into Modules\" introduced the concept of high cohesion and loose coupling in modular design.", "David Patterson (computer scientist)": "- David Andrew Patterson is an American computer pioneer and academic\n- He has held the position of professor of computer science at the University of California, Berkeley since 1976\n- Patterson coined the term RISC and led the Berkeley RISC project, with 99% of all new chips using a RISC architecture as of 2018\n- He also led the research on redundant arrays of inexpensive disks (RAID) storage with Randy Katz\n- His books on computer architecture are widely used in computer science education\n- Patterson has advised several notable Ph.D. students like David Ditzel and Garth A. Gibson\n- He has won numerous awards for research, teaching, and service, including the Turing Award for developing RISC\n- Patterson is also involved in charitable work and has participated in fundraising events for the Waves to Wine MS charity from 2003 to 2012", "David S. Johnson": "\n\n- David Stifler Johnson was an American computer scientist who specialized in algorithms and optimization.\n- He was the head of the Algorithms and Optimization Department of AT&T Labs Research from 1988 to 2013.\n- He was also a visiting professor at Columbia University from 2014 to 2016.\n- He was awarded the 2010 Knuth Prize.\n- Johnson was born in Washington D.C. in 1945 and earned his degrees in Mathematics from Amherst College and MIT.\n- He was inducted as a Fellow of the Association for Computing Machinery and a member of the National Academy of Engineering.\n- He was the coauthor of Computers and Intractability: A Guide to the Theory of NP-Completeness.\n- Johnson's publications have been cited over 96,000 times, and he has an h-index of 78.\n- He died on March 8, 2016, at the age of 70.\n- See also: NP-completeness, List of computer scientists, and List of important publications in computer science.", "David Turner (computer scientist)": "\n\n- David A. Turner is a British computer scientist known for designing and implementing three programming languages\n- The languages are SASL (1972), Kent Recursive Calculator (KRC) (1981), and Miranda (1985)\n- Miranda had a strong influence on later programming language Haskell\n- Turner has a Doctor of Philosophy from the University of Oxford\n- He has held professorships at Queen Mary College, London, University of Texas at Austin, and the University of Kent at Canterbury\n- Turner was involved in developing international standards in programming and informatics as a member of the International Federation for Information Processing\n- He is also an Emeritus Professor at Middlesex University\n- Turner has authored several publications on programming languages and implementation techniques", "David Waltz": "\n\n- David Leigh Waltz was a computer scientist\n- He made significant contributions in several areas of artificial intelligence\n- He held positions in academia and industry\n- He was a professor of Computer Science at Columbia University at the time of his death\n- He received S.B., M.S., and Ph.D. degrees in Electrical Engineering from the Massachusetts Institute of Technology (MIT)\n- His Ph.D. dissertation initiated the field of constraint propagation\n- He worked on new methods for information retrieval involving comparisons to large amounts of data\n- He originated the field of memory-based reasoning branch of case-based reasoning\n- His research interests included massively parallel information retrieval, data mining, learning and automatic classification with applications in protein structure prediction, natural language processing, and machine learning applications applied to the electric power grid.\n- He served as president of the Association for the Advancement of Artificial Intelligence (AAAI) from 1997 to 1999\n- He was elected a Fellow of Association for the Advancement of Artificial Intelligence (AAAI) in 1990 and a Fellow of the Association for Computing Machinery in 1998\n- He died from brain cancer on March 22, 2012, at the age of 68.", "David Wheeler (computer scientist)": "- David John Wheeler was a computer scientist and professor of computer science at the University of Cambridge.\n- He was born in Birmingham in 1927 and studied at Trinity College, Cambridge, where he was awarded the world's first PhD in computer science in 1951.\n- Wheeler's contributions to the field included work on EDSAC in the 1950s and the Burrows–Wheeler transform (published 1994). He also contributed to the invention of the subroutine and the design of software libraries.\n- He was responsible for the implementation of the CAP computer, the first to be based on security capabilities, and was involved in cryptography, designing the WAKE encryption algorithm.\n- He married astrophysics research student Joyce Margaret Blackler in 1957 and had two daughters and a son.\n- Wheeler was recognised with numerous awards and inducted as a Fellow of the Association for Computing Machinery.\n- He is often quoted as saying \"All problems in computer science can be solved by another level of indirection.\" and \"Compatibility means deliberately repeating other people's mistakes.\"\n- Wheeler died of a heart attack in 2004 while cycling home from the Computer Laboratory.", "Dennis E. Wisnosky": "-Dennis E. Wisnosky is an American consultant, writer, and former chief architect and chief technical officer of the US DoD Business Mission Area\n-He is known for being one of the creators and initiators of the Integrated Definition (IDEFs) language, a standard for modeling and analysis in management and business improvement efforts. \n-Wisnosky received his bachelor's degree in physics and mathematics from California University of Pennsylvania, a master's in management science from the University of Dayton, and a master's in electrical engineering from the University of Pittsburgh.\n-He founded Wizdom Systems in 1986 and later became the Chief Technical Officer for the Department of Defense (DoD) in August 2006\n-Wisnosky has published over 100 papers and authored or co-authored seven books \n-He is a frequent speaker on service-oriented architecture (SOA) and semantic technologies and has testified before subcommittees of both the U.S. House and Senate on U.S. productivity issues and the quality of American work life.", "Dennis Ritchie": "- Dennis Ritchie was an American computer scientist known for creating the C programming language and Unix operating system.\n- He worked at the Bell Labs Computing Sciences Research Center and was involved in the development of multics operating system.\n- Ritchie and his long-time colleague Ken Thompson were awarded the Turing Award in 1983, the Hamming Medal in 1990, and the National Medal of Technology in 1999.\n- Ritchie passed away in 2011 due to prostate cancer and heart disease, and his legacy is recognized in the widespread use of C and Unix in modern programming.\n- He authored or contributed to about 50 academic papers, books, and textbooks and had over 15,000 citations.\n- Asteroid 294727 Dennisritchie was named in his memory, and Fedora 16 and FreeBSD 9.0 were dedicated to his memory.", "Derek McAuley": "\n\n- Derek Robert McAuley is a British academic and Professor of Digital Economy at the University of Nottingham.\n- He is also the director of Horizon Digital Economy Research, an interdisciplinary research institute.\n- He has acted as a Specialist Advisor to the House of Lords European Union Committee and Chief Innovation Officer for the Digital Catapult.\n- McAuley has a PhD in computer science from Cambridge University and has held academic positions at the universities of Glasgow and Cambridge.\n- He also has industry experience, including co-founding the Cambridge Microsoft Research facility and founding Intel Research Cambridge.\n- His current research focuses on ubiquitous computing, computer architecture, networking, distributed systems, and operating systems.\n- McAuley is also interested in interdisciplinary issues related to ethics, privacy, information policy, legislation, and economics in a digital society.\n- He is a Fellow of the British Computer Society and a member of the UKCRC.", "Donald Firesmith": "\n\n- Donald G. Firesmith is an American software engineer, consultant, and trainer at the Software Engineering Institute.\n- He received his B.A. in Mathematics and German from Linfield College and his M.A. in Mathematics from Arizona State University.\n- Firesmith has worked as a software developer, quality engineer, configuration manager, and data manager for various companies.\n- He was President of Advanced Software Technology Specialists and an acquisition editor and editor in chief of reference books at SIGS Books.\n- Firesmith was named a Distinguished Engineer by the Association of Computing Machinery in 2015.\n- He is a co-founder of the international OPEN Consortium and the principle developer of the OPEN Modeling Language.\n- Firesmith is the founder of the OPEN Process Framework Repository Organization and the primary developer of the Method Framework for Engineering System Architectures (MFESA).\n- He has authored several technical books in system and software engineering and many technical articles, conference papers, and tutorials.\n- Firesmith is also a novelist and has written several paranormal fantasy, apocalyptic science fiction, action, and adventure novels.", "Donald Knuth": "\n\n- Donald Knuth is an American computer scientist, mathematician, and professor emeritus at Stanford University.\n- He is the 1974 recipient of the ACM Turing Award, informally considered the Nobel Prize of computer science.\n- Knuth has been called the \"father of the analysis of algorithms\" and is the author of the multi-volume work The Art of Computer Programming.\n- He created the TeX computer typesetting system, the related METAFONT font definition language and rendering system, and the Computer Modern family of typefaces.\n- Knuth created the WEB and CWEB computer programming systems designed to encourage and facilitate literate programming, and designed the MIX/MMIX instruction set architectures.\n- Knuth strongly opposes the granting of software patents, having expressed his opinion to the United States Patent and Trademark Office and European Patent Organisation.\n- Knuth is a writer and has written books on computer science and mathematics, as well as Surreal Numbers, a mathematical novelette on John Conway's set theory construction of an alternate system of numbers.\n- Knuth is an organist and a composer.\n- Knuth was diagnosed with prostate cancer in 2006 and underwent surgery.\n- Knuth is known for his humor, which includes paying a finder's fee for typographical errors in his books, intentionally referring to circular definitions in the index of his books, and proposing a satirical XML-based successor to TeX called \"iTeX\".\n- Knuth has received various awards and honors, including the Turing Award, the National Medal of Science, and the Kyoto Prize. He is a member of multiple academies of science and engineering.", "Dora Metcalf": "\n\n- Dora Stuart Primrose Metcalf was an entrepreneur, mathematician and computing pioneer.\n- She was born in Madras (now Chennai) in India to Irish parents and was the oldest of three children.\n- She won a scholarship to take an external degree with the University of London when she was 15 years old and obtained her Bachelor's degree in mathematics by the age of 19.\n- During World War I, she worked as a comptometer operator in a munitions factory and realised the potential of mechanical calculators.\n- In 1916, she was sent to Belfast to introduce comptometers into the shipyard offices and set up offices in Dublin and Cork in 1917.\n- In 1924, she founded Calculating And Statistical Services (CSS), which she ran successfully and provided international markets for information services using comptometers and tabulators.\n- She joined British Tabulating Machine Company (BTM) in 1934 and founded the Service Bureaux Division, while continuing to run CSS.\n- During World War II, BTM supplied \"bombe\" decryption machines to the codebreakers at Bletchley Park in England, and Metcalf was in charge of managing the supply contract but had to leave due to ill health.\n- She introduced the first electronic computer into Ireland in 1957 and retired in 1962.\n- She enjoyed fishing for salmon and trout with her husband, Commander John Savile Dent Metcalf, and they spent their final years in Otley in Yorkshire.\n- Dora Metcalf died in 1982 at the age of 90 and was buried in the Lawnswood Cemetery and Crematorium in Leeds in West Yorkshire.", "Dorothy Blum": "\n\n- Dorothy Toplitzky Blum was an American computer scientist and cryptanalyst.\n- She worked for the National Security Agency (NSA) and its predecessors from 1944 until her death in 1980.\n- She was born in 1924 in New York City to Austro-Hungarian immigrant parents.\n- After graduating from Brooklyn College in 1944, she joined the cryptologic unit of the U.S. Army.\n- During her time at the NSA in the 1950s, Blum recommended computer technologies that could be adapted for cryptanalysis and communications intelligence, including using the FORTRAN programming language before its public release.\n- Blum continued to work in computer science throughout the 1960s and 1970s, helping to design the NSA's computer systems and automate processes.\n- Blum died from cancer in 1980, aged 56. \n- The Dorothy T Blum Award for excellence in employee personal and professional development was named after her.\n- In 2004, she was inducted into the NSA Hall of Honor.\n- She was married to NSA mathematician Joseph Blum and had one son, David Blum.", "Dorothy E. Denning": "\n\n- Dorothy Elizabeth Denning is an American information security researcher.\n- She is known for her work on lattice-based access control (LBAC), intrusion detection systems (IDS), and other cybersecurity innovations.\n- She has published four books and over 200 articles throughout her career.\n- Denning was inducted into the National Cyber Security Hall of Fame in 2012.\n- She is now Emeritus Distinguished Professor of Defense Analysis at the Naval Postgraduate School.\n- Denning earned a Bachelor of Arts degree in mathematics in 1967 followed by a Master of Arts degree in 1969 at the University of Michigan.\n- She received her PhD from Purdue University in 1975, her thesis focusing on secure information flow in computer systems.\n- Denning began her academic career as an assistant professor at Purdue University, then held positions at SRI International, Digital Equipment Corporation, and Georgetown University before joining the Naval Postgraduate School.\n- Her key innovations in computer security include the development of intrusion detection systems, encryption technology, and multilevel database security techniques.\n- Denning was involved in the controversial Clipper chip initiative to give the government authorized access to encrypted private communications through a key escrow system.\n- She has received over 20 awards for her contributions to computer security and was named an ACM Fellow, an ISSA distinguished fellow, and a fellow of the International Information Security Certification Consortium.\n- Denning and her husband, Peter J. Denning, were married in 1974 while she was working on her PhD at Purdue University.", "Dorothy Vaughan": "- Dorothy Jean Johnson Vaughan was an American mathematician and human computer who worked for NACA and NASA.\n- In 1949, she became the first African-American woman to receive a promotion and supervise a group of staff at the center.\n- During her 28-year career, Vaughan prepared for the introduction of computers in the early 1960s by teaching herself and her staff the programming language of Fortran.\n- Vaughan is featured in Margot Lee Shetterly's book, Hidden Figures, and the film of the same name.\n- Vaughan was posthumously awarded the Congressional Gold Medal in 2019 and had a lunar crater and a satellite named after her.", "Douglas Comer": "- Douglas Earl Comer is a professor of computer science at Purdue University.\n- He is an internationally recognized authority on TCP/IP and internetworking.\n- Comer designed and implemented X25NET and Cypress networks, and the Xinu operating system.\n- Xinu has been expanded and ported to a wide variety of platforms and used by companies like Motorola and Hewlett-Packard.\n- Comer has authored numerous research papers and textbooks, including a three-volume series on Internetworking With TCP/IP.\n- He has received numerous teaching awards and is a Fellow of the ACM.\n- Comer has also received research grants for various projects related to communication and networks.\n- He has won several awards, including the Usenix \"The Flame\" Lifetime Achievement Award and has been inducted into the Internet Hall of Fame.", "Douglas Lenat": "- Douglas Bruce Lenat is the CEO of Cycorp, Inc. and a prominent researcher in artificial intelligence.\n- He received the IJCAI Computers and Thought Award in 1976 for his creation of the machine-learning program AM.\n- Lenat has worked on symbolic machine learning, knowledge representation, cognitive economy, blackboard systems, and ontological engineering.\n- He has also worked on military simulations and numerous projects for US government, military, intelligence, and scientific organizations.\n- Lenat is a Fellow of the AAAS, AAAI, and Cognitive Science Society, and an editor of several journals.\n- He was one of the founders of TTI/Vanguard in 1991 and remains a member of its advisory board.\n- Lenat earned his bachelor's and master's degrees from the University of Pennsylvania and his Ph.D. from Stanford University.\n- Lenat's thesis, AM, was one of the first computer programs that attempted to make discoveries.\n- Lenat called for a vast knowledge base of \"common sense\" and an inference engine capable of finding deep conclusions and arguments to make progress toward real, general, symbolic AI.\n- Lenat was principal scientist of the MCC research consortium and moved to Cycorp in 1994.\n- He estimates that completing Cyc would require at least 250,000 rules and 1,000 person-years of effort, but the team has spent about 2,000 person-years of effort building Cyc.\n- Lenat continues his work on Cyc as CEO of Cycorp and has applied it to various fields, including education.\n- Lenat has authored several papers and books, including \"Building Large Knowledge-Based Systems: Representation and Inference in the Cyc Project.\"", "Douglas McIlroy": "- Malcolm Douglas McIlroy is a mathematician, engineer, and programmer\n- He proposed Unix pipelines and developed several Unix tools such as spell, diff, sort, join, graph, speak, and tr\n- He was one of the pioneering researchers of macro processors and programming language extensibility\n- McIlroy participated in the design of multiple programming languages, particularly PL/I, SNOBOL, ALTRAN, TMG, and C++\n- He is a pioneer of component-based software engineering and software product line engineering\n- McIlroy earned his bachelor's degree from Cornell University and a Ph.D. from MIT\n- He worked at Bell Laboratories from 1958 to 1997 and was head of its Computing Techniques Research Department\n- McIlroy is considered a pioneer of macro processors, and his contributions to Unix had a lasting impact on modern operating systems\n- He has won multiple awards for his lifetime achievements and was elected as a member of the National Academy of Engineering\n- McIlroy has also made significant contributions to the field's algorithms, particularly sorting techniques", "Douglas T. Ross": "\n\n- Douglas Taylor \"Doug\" Ross was an American computer scientist pioneer and chairman of SofTech, Inc.\n\n- He originated the term CAD for computer-aided design.\n\n- Ross is considered to be the father of Automatically Programmed Tools (APT), a programming language to drive numerical control in manufacturing.\n\n- His later work focused on a pseudophilosophy he developed and named Plex.\n\n- Ross contributed to the MIT Whirlwind I computer project, which was the first to display real-time text and graphics.\n\n- Ross helped develop Structured Analysis into the IDEF0 method for the Air Force's Integrated Computer-Aided Manufacturing (ICAM) program's IDEF suite of analysis and design methods.\n\n- He was an early developer of structured analysis methods and a founding member of Society for Industrial and Applied Mathematics (SIAM).\n\n- Ross was a member of IFIP Working Group 2.1 on Algorithmic Languages and Calculi, which specified, maintains, and supports the programming languages ALGOL 60 and ALGOL 68.\n\n- Ross died on January 31, 2007, after a long battle with Parkinson's Disease.", "Dragomir R. Radev": "\n\n- Dragomir R. Radev is a Yale University professor of computer science.\n- He has worked on natural language processing and information retrieval, as well as NLP in Bioinformatics, Social Network Analysis and Political Science.\n- Radev received his PhD from Columbia University in 1999.\n- He is the secretary of [1] (2006–present) and associate editor of JAIR.\n- Radev has received awards such as the Gosnell Prize (2006) and the Association for Computing Machinery (ACM) Fellow (2015) for contributions to natural language processing and computational linguistics.\n- He has coached and led the US national team in the International Linguistics Olympiad (IOL) to several gold medals.\n- Radev has published books including Puzzles in Logic, Languages and Computation (2013) and Graph-based Methods for NLP and IR (2011).\n- His selected papers cover topics such as natural language processing, text summarization, and gene-disease associations.\n- External links include news articles and award recognition for Radev's work.", "E. Allen Emerson": "- E. Allen Emerson is an American computer scientist and winner of the 2007 Turing Award.\n- He is Professor and Regents Chair Emeritus at the University of Texas at Austin.\n- Emerson, together with Edmund M. Clarke and Joseph Sifakis, invented and developed model checking, a technique used in formal verification of software and hardware.\n- He introduced computation tree logic (CTL) and its extension CTL*, which are used in the verification of concurrent systems.\n- Emerson also developed symbolic model checking to address combinatorial explosion in many model checking algorithms.\n- He received a Bachelor of Science degree in mathematics from the University of Texas at Austin in 1976 and a Doctor of Philosophy degree in applied mathematics at Harvard University in 1981.\n- Emerson and Clarke coined the term model checking for their verification concept in the early 1980s.\n- In 2007, Emerson, Clarke, and Sifakis won the Turing award for their role in developing Model-Checking into a highly effective verification technology.\n- Emerson also received the 1998 ACM Paris Kanellakis Award for the development of symbolic model checking.\n- He is recognized as one of the pioneers in computer science.", "Edgar F. Codd": "- Edgar Frank \"Ted\" Codd was an English computer scientist who invented the relational model for database management.\n- He studied mathematics and chemistry at Exeter College, Oxford before moving to New York to work for IBM in 1948.\n- He received a PhD in 1965 from the University of Michigan, Ann Arbor, advised by John Henry Holland, on self-replication in cellular automata.\n- In the 1960s and 1970s, he worked on his theories of data arrangement and issued his paper \"A Relational Model of Data for Large Shared Data Banks\" in 1970.\n- Codd continued to develop and extend his relational model, sometimes in collaboration with Christopher J. Date.\n- He coined the term Online analytical processing (OLAP) and wrote the \"twelve laws of online analytical processing.\"\n- Codd received the Turing Award in 1981 and the SIGMOD renamed its highest prize to the SIGMOD Edgar F. Codd Innovations Award in his honor in 2004.\n- Codd died of heart failure at his home in Williams Island, Florida, at the age of 79 on 18 April 2003.", "Edmund M. Clarke": "\n\n- Edmund Melson Clarke Jr. was an American computer scientist and academic.\n- He is noted for developing model checking, a method for formally verifying hardware and software designs.\n- Clarke was the FORE Systems Professor of Computer Science at Carnegie Mellon University.\n- He received his Ph.D. in Computer Science from Cornell University and taught at Duke University and Harvard University before joining the faculty at Carnegie Mellon.\n- Clarke's research interests included software and hardware verification and automatic theorem proving.\n- He was a fellow of the ACM and the IEEE and received numerous awards and honors for his contributions to computer science.\n- Clarke died from COVID-19 in December 2020, at age 75, during the COVID-19 pandemic in Pennsylvania.", "Edward D. Lazowska": "\n\n- Edward D. \"Ed\" Lazowska is an American computer scientist and Professor at the University of Washington.\n- His research focuses on high-performance computing, communication systems, and data-intensive science.\n- He has contributed to the development of approaches to kernel and system design in various areas, including thread management, load sharing, and cluster computing.\n- From 2008 to 2017, he was the Founding Director of the University of Washington eScience Institute.\n- Lazowska has held various leadership positions, including Chair of the Computing Research Association, the President’s Information Technology Advisory Committee, and the Computing Community Consortium.\n- He also serves as a board member or technical advisor for several technology-oriented organizations.\n- Lazowska has mentored many graduate and undergraduate students, including well-known figures in the field of computer science.\n- He has received numerous awards and recognition for his contributions to the field, including the Association for Computing Machinery Presidential Award and the ACM Distinguished Service Award.\n- Lazowska was born in Washington, D.C. in 1950 and earned his degrees from Brown University and the University of Toronto.\n- To celebrate Lazowska's 70th birthday, funds were raised to endow a set of Lazowska Professorships at the University of Washington.", "Edward Feigenbaum": "\n\n- Edward Albert Feigenbaum is a computer scientist specializing in artificial intelligence.\n- He is known as the \"father of expert systems.\"\n- Feigenbaum completed his undergraduate degree and Ph.D. at Carnegie Institute of Technology (now Carnegie Mellon University).\n- He developed EPAM, one of the first computer models of how people learn, in his Ph.D. thesis.\n- Feigenbaum joined the faculty at the University of California, Berkeley in 1960 and later joined the Stanford faculty in 1965.\n- He established the Knowledge Systems Laboratory at Stanford University and was involved in important projects in medicine, such as ACME, Mycin, SUMEX, and Dendral.\n- Feigenbaum co-founded companies IntelliCorp and Teknowledge.\n- He has won numerous awards including the Turing Award jointly with Raj Reddy in 1994.\n- Feigenbaum is a Professor Emeritus of Computer Science at Stanford University.\n- His works include the Handbook of Artificial Intelligence, which he co-edited with Avron Barr and Paul Cohen.", "Edward Felten": "- Edward William Felten is a computer science and public affairs professor at Princeton University.\n- He was the Director of the Center for Information Technology Policy from 2007 to 2015 and from 2017 to 2019.\n- Felten was named Chief Technologist for the Federal Trade Commission in 2010 and Deputy U.S. Chief Technology Officer in 2015.\n- His research involves computer security and technology policy.\n- Felten was a witness in the United States v. Microsoft case where he demonstrated a tool to remove Internet Explorer without causing any problems with the operating system.\n- He is perhaps best known for his work on the Secure Digital Music Initiative (SDMI) challenge to break digital audio watermark technologies.\n- Felten, with help from the Electronic Frontier Foundation, sued SDMI and other copyright holders, requesting a declaratory judgment ruling that the publication of their scientific paper would be legal.\n- He discovered security flaws in a Diebold Election Systems voting machine and Sequoia Advantage voting machines.\n- In February 2008, Felten was part of the team that discovered the cold boot attack, which allows someone with physical access to a computer to bypass operating system protections.\n- Felten was named the first Chief Technologist of the Federal Trade Commission in 2010.", "Edward H. Shortliffe": "\n\n- Edward (\"Ted\") Hance Shortliffe is a Canadian-born American biomedical informatician, physician, and computer scientist.\n- He is a pioneer in the use of artificial intelligence in medicine, and was the principal developer of the clinical expert system MYCIN, a rule-based artificial intelligence expert system.\n- He is regarded as a founder of the field of biomedical informatics, and received the Morris F. Collen Award from the American College of Medical Informatics in 2006.\n- He has held administrative positions in academic medicine, research and national bodies including the Institute of Medicine, American College of Physicians, National Science Foundation, National Institutes of Health, and National Library of Medicine.\n- In March 2007, he became founding dean of the University of Arizona's College of Medicine - Phoenix campus, and in July 2009, he assumed a position as president and chief executive officer of the American Medical Informatics Association.\n- He has authored over 300 publications and 7 books on the topic of biomedical informatics.\n- He has been honored with awards like the Grace Murray Hopper Award, Henry J. Kaiser Family Foundation Faculty Scholar in General Internal Medicine, and the Young Investigator Award from the Western Society for Clinical Investigation.", "Edward Yourdon": "- Edward Nash Yourdon was an American software engineer, computer consultant, author and lecturer, and software engineering methodology pioneer\n- He was one of the lead developers of the structured analysis techniques of the 1970s and co-developed Yourdon/Whitehead and Coad/Yourdon methodologies for object-oriented analysis/design\n- Yourdon founded the consulting firm Yourdon Inc. in 1974 and sold it in 1986\n- He predicted that the Y2K bug could lead to collapse of civilization, which did not materialize at the scale predicted and caused him to lose credibility with some in the software industry\n- Yourdon authored over 550 technical articles and 26 computer books since 1967, including \"Decline and Fall of the American Programmer\", \"Object-Oriented Systems Development: An Integrated Approach\", and \"Death March: The Complete Software Developer's Guide to Surviving 'Mission Impossible' Projects\"", "Edwin Catmull": "-Edwin Catmull is an American computer scientist who co-founded Pixar and was the President of Walt Disney Animation Studios.\n\n-He is known for his contributions to 3D computer graphics and was honored with the 2019 ACM Turing Award.\n\n-As a student, Catmull discovered texture mapping and bicubic patches and invented algorithms for spatial anti-aliasing and refining subdivision surfaces.\n\n-In 1972, he made his earliest contribution to the film industry, creating a one-minute animated version of his left hand.\n\n-He worked for Applicon and the New York Institute of Technology before being recruited by George Lucas to bring computer graphics, video editing, and digital audio into the entertainment field.\n\n-He became Vice President at Industrial Light & Magic computer graphics division at Lucasfilm in 1979.\n\n-In 1986, Steve Jobs bought Lucasfilm's digital division and founded Pixar, where Catmull would work.\n\n-He was implicated in the High-Tech Employee Antitrust scandal while at Pixar.\n\n-He received several awards for his contributions to computer graphics and filmmaking, including the Gordon E. Sawyer Award and the 2019 Turing Award.\n\n-Catmull's book, \"Creativity, Inc.: Overcoming the Unseen Forces That Stand in the Way of True Inspiration,\" was shortlisted for the Financial Times and Goldman Sachs Business Book of the Year Award.", "Edwin E. Tozer": "- Edwin Ellis (Ed) Tozer is a retired British management and IT consultant and SF author.\n- He started his career in the manufacturing and mining industry before becoming a junior systems analyst at Scicon in London in 1969.\n- In 1984, he founded Edwin E. Tozer Limited, which specialized in data management study and dissolved after his retirement in 2008.\n- Tozer is known for his early work on business information systems in the 1970s and 1980s.\n- He wrote several books, including \"Application Development Tools\" (1984), \"Planning for Effective Business Information Systems\" (1988), and \"Strategic Is/It Planning\" (1996).\n- Tozer was one of the first to propose the concept of business architecture in the field of business information systems planning.\n- His model for developing information systems consisted of four phases: determining business information needs, developing conceptual architecture for systems and data, determining key priorities and system groupings, and migration planning.\n- Tozer also wrote science fiction, including \"Morphosis\" (2010), where he speculated on the evolution of mankind as a species.", "Eiiti Wada": "\n\n- Eiiti Wada is a computer scientist and emeritus professor at the University of Tokyo.\n- He is the Research Director of Internet Initiative Japan (IIJ), a computer network technology company.\n- Wada is one of the creators of the Happy Hacking Keyboard.\n- In 1968, he was a member of the design team for a Japanese candidate language named ALGOL N, which was not chosen for ALGOL 68.\n- He became a member of IFIP WG2.1 in 1972, which specified, maintains, and supports ALGOL 60 and 68.\n- He was a member of the International Organization for Standardization (ISO) and contributed to character encoding set standards.\n- Wada helped create related Japanese Industrial Standards (JIS) X 0208, 0212.\n- As of 2020, he works on computer graphics for the IIJ Innovation Institute.", "Eldon C. Hall": "- Eldon Hall led hardware design for the Apollo Guidance Computer (AGC) at MIT\n- He advocated for the use of integrated circuits in the AGC\n- Hall wrote extensively about the development of the AGC, culminating in his book Journey to the Moon\n- He pursued undergraduate education at Eastern Nazarene College, graduate education at Boston University, and a doctoral degree at Harvard University (although he did not complete the PhD)\n- Hall also wrote an autobiography titled From the Farm to Pioneering with Digital Computers\n- References are included in the article.", "Emil Post": "- Emil Leon Post was an American mathematician and logician born in Poland in 1897.\n- He is best known for his work in computability theory and developing a mathematical model of computation similar to Alan Turing's.\n- Post proved that the propositional calculus of Principia Mathematica was complete in his doctoral thesis and also independently discovered truth tables.\n- He made important contributions to the theory of polyadic groups and demonstrated that a polyadic group operation on a set can be expressed in terms of a group operation on the same set.\n- Post introduced correspondence systems in 1946 to give examples of undecidability, and the Post Correspondence Problem he introduced turned out to be exactly what was needed to obtain undecidability results in the theory of formal languages.\n- Post's problem, which he raised in 1944, stimulated much research and was later solved in the affirmative in the 1950s.\n- Post died in 1954 at the age of 57 following electroshock treatment for depression.", "Eric Hehner": "\n\n- Eric \"Rick\" C. R. Hehner is a Canadian computer scientist born in Ottawa on September 16, 1947.\n- He holds a Bachelor of Science (B.Sc.) in Mathematics and Physics from Carleton University, and a Master of Science (M.Sc.) and a Doctor of Philosophy (Ph.D.) in Computer Science from the University of Toronto.\n- He joined the faculty at the University of Toronto, becoming a full professor in 1983 and retiring in 2012.\n- Hehner's main research area is formal methods of software design which can apply to different types of programs, including sequential, parallel, terminating, and nonterminating ones.\n- He is the inventor of quote notation, a representation of rational numbers that allows easier arithmetic and avoids roundoff error.\n- He was involved in the development of international standards in programming and informatics as a member of International Federation for Information Processing (IFIP) working groups on Algorithmic Languages and Calculi, and on Programming Methodology.\n- Hehner's other research areas include probabilistic programming, unified algebra, and high-level circuit design.\n- He has published several articles and a book called \"A Practical Theory of Programming,\" which is available for free in PDF format.\n- His archival papers are held at the University of Toronto Archives and Records Management Services.", "Erik Demaine": "- Erik D. Demaine is a professor of computer science at MIT and a former child prodigy\n- He was homeschooled and started university at the age of 12, completing his bachelor's degree at 14 and his PhD at 20\n- His PhD work focused on computational origami and earned him several awards\n- Demaine is part of the Theory of Computation group at MIT\n- He creates mathematical origami with his father Martin Demaine, which has been exhibited at the Museum of Modern Art and the Smithsonian Museum\n- In 2001, he co-edited a tribute book for Martin Gardner with his father and Gathering 4 Gardner founder Tom M. Rodgers\n- Demaine has received numerous awards, including the MacArthur Fellowship, EATCS Presburger Award, and Nerode Prize\n- He is a fellow of the Association for Computing Machinery and has been awarded an honorary doctorate by Bard College\n- External links include his MIT News biography and publications indexed by Google Scholar.", "Eugene Luks": "\n\n- Eugene Michael Luks is an American mathematician and computer scientist.\n- He is a professor emeritus of computer and information science at the University of Oregon.\n- Luks is known for his research on the graph isomorphism problem and on algorithms for computational group theory.\n- He earned his undergraduate degree at the City College of New York and his doctorate in mathematics at the Massachusetts Institute of Technology.\n- Luks taught at Tufts University and Bucknell University before joining the University of Oregon faculty.\n- In 1985, he won the Fulkerson Prize for his work on graph isomorphism.\n- In 2012, he became a fellow of the American Mathematical Society.\n- His notable publications include \"Polynomial-time algorithms for permutation groups\", \"Isomorphism of graphs of bounded valence can be tested in polynomial time\", and \"Canonical labeling of graphs\".", "Fernando J. Corbató": "\n\n- Fernando José \"Corby\" Corbató was a prominent American computer scientist.\n- He was notable as a pioneer in the development of time-sharing operating systems.\n- Corbató was born on July 1, 1926, in Oakland, California.\n- He earned a PhD in physics from the Massachusetts Institute of Technology in 1956.\n- The first time-sharing system he was associated with was known as the MIT Compatible Time-Sharing System (CTSS).\n- He is credited with the first use of passwords to secure access to files on a large computer system.\n- Corbató received the Turing Award in 1990.\n- He died on July 12, 2019, in Newburyport, Massachusetts, at the age of 93 due to complications from diabetes.", "Frances E. Allen": "\n\n- Frances Elizabeth Allen was an American computer scientist and pioneer in the field of optimizing compilers.\n- Allen was the first woman to become an IBM Fellow, and in 2006 became the first woman to win the Turing Award.\n- Her achievements include seminal work in compilers, program optimization, and parallelization.\n- Allen worked for IBM from 1957 to 2002 and subsequently was a Fellow Emerita.\n- Allen grew up on a farm in Peru, New York, near Lake Champlain, as the oldest of six children.\n- She graduated from The New York State College for Teachers with a Bachelor of Science degree in mathematics in 1954 and earned a Master of Science degree in mathematics in 1957.\n- Her papers on program optimization were fundamental in the field of optimizing compilers, and her contributions had a significant impact on compiler research and practice.\n- Allen was a Fellow of the Institute of Electrical and Electronics Engineers (IEEE) and the Association for Computing Machinery (ACM).\n- In addition to the Turing Award, Allen received various honors and awards, including the IEEE Computer Society Charles Babbage Award and the Computer Pioneer Award.\n- Allen died on August 4, 2020, on her 88th birthday, from complications with Alzheimer's disease.", "Franco Preparata": "\n\n- Franco P. Preparata is a computer scientist and the An Wang Professor Emeritus of Computer Science at Brown University.\n- He authored the book \"Computational Geometry: An Introduction\" in 1985, which became the standard textbook in the field and was translated into four languages.\n- Preparata has made significant contributions to computational geometry, including the notion of \"algorithmic degree\" for controlling geometric algorithms.\n- He worked in coding theory, parallel computation, and VLSI theory, publishing several papers that received awards.\n- Preparata's recent research has focused on computational biology, including a novel approach to DNA sequencing by hybridization.\n- He received his doctorate from the University of Rome in 1959 and has published nearly 250 articles and three books.\n- Preparata is an IEEE and ACM Fellow and was awarded an honorary doctorate from the University of Padova in 1997.\n- He advises many Ph.D. students and is well respected in the field of computer science.", "Frank Harary": "\n\n- Frank Harary was an American mathematician specializing in graph theory.\n- He was known as one of the \"fathers\" of modern graph theory, standardizing its terminology and broadening its reach to include fields like physics, psychology, sociology, and anthropology.\n- Harary was a skilled communicator and often turned theorems into games or puzzles to challenge and entertain his audience at various levels of mathematical proficiency.\n- He earned his Ph.D. from the University of California, Berkeley, and taught at the University of Michigan before becoming a Distinguished Professor at New Mexico State University.\n- He authored multiple books on graph theory, published over 800 papers, and became famous for his work on graph enumeration and signed graphs.\n- Harary also played a role in improving the DeGroot learning model in behavioral economics, and developed a method for detecting cliques in social networks.\n- One of Harary's notable contributions is the study of the \"tree square root\" of a graph and how to determine if a graph is derived from it.\n- Harary received several honors and awards for his work and contributions, including becoming an honorary lifetime member of the Calcutta Mathematical Society and the South African Mathematical Society.\n- He passed away in 2005, leaving behind an extensive bibliography of scholarly articles and books.", "François Vernadat": "- François B. Vernadat is a French and Canadian computer scientist specializing in enterprise architectures, business process modeling, information systems design and analysis, systems integration and interoperability, and systems analysis using Petri nets.\n- He received a master's degree in Electronics and Automatic Control and a PhD in 1981 from the University of Clermont, France.\n- He has been a research officer at the National Research Council of Canada and at Institut National de Recherche en Informatique et Automatique (INRIA), France.\n- He has been a professor at the University of Metz in automatic control and industrial engineering and is currently the head of the IT Infrastructure department of the European Court of Auditors.\n- He has authored over 280 scientific papers in journals, conferences, and edited books and is an associate editor for \"Computers in Industry,\" \"International Journal of Production Research,\" and \"Computers & Industrial Engineering,\" among others.\n- His research work has been dealing with enterprise architectures, enterprise engineering, enterprise modeling, enterprise integration, information systems design and analysis, and various aspects of industrial engineering such as facility layout, performance management, cost estimation, and competency modeling.\n- Some of his notable publications include \"Enterprise Modeling and Integration: Principles and Applications,\" \"The CIMOSA Languages,\" and \"Interoperable Enterprise Systems: Principles, Concepts, and Methods.\"", "Fred B. Schneider": "- Frederick William Schneider III is an American singer, songwriter, arranger, and musician.\n\n- He is the frontman of the rock band the B-52's, of which he is a founding member.\n\n- Schneider is well known for his sprechgesang, which he developed from reciting poetry over guitars.\n\n- He was born in Newark, New Jersey in 1951 and lived in Oceanport, New Jersey after moving there from Belleville, New Jersey.\n\n- Schneider attended the University of Georgia where he wrote a book of poetry for a class project.\n\n- The B-52's got their start in 1976 when founders Cindy Wilson, Ricky Wilson, Kate Pierson, Keith Strickland, and Schneider played an impromptu number after drinking at a Chinese restaurant in Athens, Georgia.\n\n- After the death of Ricky Wilson in 1985, the band went on hiatus but reformed in 1989 and went on to mainstream success.\n\n- Apart from B-52's, Schneider has released two solo albums and worked on a side project called the Superions.\n\n- Until late 2008, Schneider hosted a show called Party Out of Bounds.\n\n- Schneider's personal life includes being a lifelong vegetarian and coming out as gay to his mother.\n\n- He has appeared in films and TV shows and has also written a few books.", "Frieder Nake": "\n\n- Frieder Nake is a mathematician, computer scientist, and pioneer of computer art.\n\n- He is known internationally for his contributions to the earliest manifestations of computer art.\n\n- Nake had his first exhibition at Galerie Wendelin Niedlich in Stuttgart in November 1965.\n\n- Until 1969, Nake generated about 300 to 400 works that he showed in many exhibitions.\n\n- Nake participated in important group shows of the 1960s, such as Cybernetic Serendipity.\n\n- In 1971, he wrote a provocative note for Page, the Bulletin of the Computer Arts Society.\n\n- His book \"Ästhetik als Informationsverarbeitung\" (1974) is one of the first to study connections between aesthetics, computing, and information theory.\n\n- He has been a professor of interactive computer graphics at the Department of Computer Science at Bremen since 1972.\n\n- He won the First Prize of the Computer Art Contest of Computers & Automation in 1966.\n\n- Nake's work is represented in public collections worldwide, including the Tate Gallery in London and the Museum of Contemporary Art in Zagreb.", "Friedrich L. Bauer": "- Friedrich Ludwig \"Fritz\" Bauer was a German pioneer of computer science and professor at the Technical University of Munich.\n- He studied mathematics and theoretical physics at Ludwig-Maximilians-Universität in Munich.\n- Bauer was involved in constructing computing machinery and proposed the widely used stack method of expression evaluation.\n- He was a member of committees that developed imperative computer programming languages ALGOL 58 and its successor ALGOL 60.\n- Bauer was an influential figure in establishing computer science as an independent subject in German universities.\n- He coined the term software engineering and defined it as the \"Establishment and use of sound engineering principles to economically obtain software that is reliable and works on real machines efficiently.\"\n- Bauer's scientific contributions also spread from numerical analysis and fundamentals of interpretation and translation of programming languages to program transformation methods and systems.\n- Bauer was the doctoral advisor of 39 students.\n- He was one of the 19 founding members of the German Informatics Society and editor of the Informatik Spektrum.\n- Bauer received numerous awards and honorary doctorates.\n- The Technical University of Munich awards the Friedrich L. Bauer Prize in computer science in his honor.\n- Bauer's publications include papers on compilers, the introduction to ALGOL, and books on cryptology.", "G.M. Nijssen": "\n\n- Gerardus Maria \"Sjir\" Nijssen is a Dutch computer scientist, former professor of computer science at the University of Queensland, consultant, and author.\n\n\n- Nijssen is considered the founder of verbalization in computer science, and one of the founders of business modeling and information analysis based on natural language.\n\n\n- Nijssen finished his study at the Eindhoven University of Technology in 1965, and started working at Philips at the department of Commercial Efficiency Research.\n\n\n- In 1970 he moved to the Control Data Corporation, a pioneer in the field of computer science with the European headquarters in Brussels in Belgium. In those years he started fact-based modeling and developed NIAM.\n\n\n- During the period of 1982 to 1989 Nijssen was a full-time professor of Computer science at the University of Queensland in Brisbane, Australia, where he worked together with Terry Halpin amongst others in further developing NIAM.\n\n\n- When returning to the Netherlands in 1989, he founded PNA Group and accepted a position at the University of Maastricht, Netherlands.\n\n\n- Nijssen published more than 50 articles and 7 books.\n\n\n- Nijssen's notable published work includes \"Conceptual Schema and Relational Database Design: a fact oriented approach\" and \"CogNIAM\".\n\n\n- Nijssen developed Cognition enhanced Natural language Information Analysis Method (CogNIAM) focused entirely on the most productive protocol for the development of business requirements and integrated business modeling.", "Gary William Flake": "\n\n- Gary William Flake is a computer scientist and author.\n- He received his bachelor's degree from Clemson University and his PhD from the University of Maryland.\n- Flake has published works related to machine-learning, data-mining, and self-organization.\n- He worked at NEC Research Institute, Overture, Yahoo! Research Labs, and Microsoft Live Labs before founding Clipboard in 2011.\n- Salesforce acquired Clipboard in 2013, and Flake became the CTO for Search.\n- Flake has served on academic conference committees and is a member of the editorial board for the ACM's Transactions on Internet Technologies.", "Gastón Gonnet": "\n\n- Gaston H. Gonnet is a computer scientist and entrepreneur from Uruguay.\n- He received his doctorate in computer science from the University of Waterloo in 1977.\n- Gonnet co-founded the Symbolic Computation Group at the University of Waterloo in 1980.\n- He also co-founded Waterloo Maple Inc. in 1988 to sell the Maple system commercially.\n- Gonnet co-founded the New Oxford English Dictionary project in 1984, which led to the creation of a digital version of the Oxford English Dictionary.\n- Gonnet is a computer science professor at ETH Zurich in Switzerland and has developed the Darwin programming language and OMA package for gene orthology prediction.\n- He is the chief scientist of Canadian startups CeeqIT and Porfiau.\n- On June 9, 2011, Gonnet and Keith O. Geddes received the ACM Richard D. Jenks Memorial Prize for Excellence in Software Engineering Applied to Computer Algebra for the Maple Project.\n- Gonnet was awarded a Dr. Honoris Causa by the Universidad de la República, engineering faculty from Uruguay on March, 14 2013.", "Gene Amdahl": "- Gene Myron Amdahl was an American computer architect and high-tech entrepreneur\n- He was born to immigrant parents of Norwegian and Swedish descent in Flandreau, South Dakota\n- He completed a degree in engineering physics at South Dakota State University in 1948\n- He worked on the IBM mainframe computers, including the IBM 704, IBM 709, and the Stretch project, which was the basis for the IBM 7030\n- He formulated Amdahl's law, which states a fundamental limitation of parallel computing\n- He left IBM in 1970 and set up Amdahl Corporation in Sunnyvale, California, which manufactured \"plug-compatible\" mainframes and sold over US$1 billion of V6 and V7 mainframes by 1979\n- He left Amdahl Corporation in 1979 and set up Trilogy Systems, Commercial Data Servers, and Andor International, but all faced various challenges and eventually failed\n- He co-founded Xbridge Systems, which builds software to scan mainframe datasets for sensitive information, and was appointed to the board of advisors of Massively Parallel Technologies in 2004\n- Amdahl received numerous awards and patents to his credit and has received Honorary Doctorates from his alma maters and two other institutions\n- He died on November 10, 2015, in Palo Alto, California, from pneumonia, six days shy of his 93rd birthday.", "Gene Golub": "- Gene Howard Golub was an American numerical analyst and professor.\n- He taught at Stanford University and advised over 30 doctoral students.\n- Golub was pivotal in creating the NA-Net and the NA-Digest, as well as the International Congress on Industrial and Applied Mathematics.\n- He contributed to algorithms for matrix decompositions, including publishing an algorithm for singular value decomposition (SVD) in 1970 that is still used today.\n- Golub was recognized for his work with various awards and memberships to national academies.\n- He authored many articles and several books, including \"Matrix Computations\" co-authored with Charles F. Van Loan.\n- Golub passed away in 2007 from acute myeloid leukemia.", "Geoffrey Hinton": "\n\n- Geoffrey Hinton is a British-Canadian cognitive psychologist and computer scientist, known for his work on artificial neural networks.\n- He works for Google Brain and the University of Toronto.\n- Hinton co-authored a paper in 1986 with David Rumelhart and Ronald J. Williams, which popularized the backpropagation algorithm.\n- Hinton is considered a leading figure in the deep learning community and was awarded the Turing Award in 2018 with Yoshua Bengio and Yann LeCun.\n- Hinton's research includes investigations into neural networks for machine learning, memory, perception, and symbol processing.\n- Hinton has been honored with numerous awards, including the Herzberg Canada Gold Medal for Science and Engineering, and the BBVA Foundation Frontiers of Knowledge Award.\n- Hinton is related to several notable figures, including the mathematician Mary Everest Boole and the logician George Boole.\n- Hinton has expressed disapproval of military funding of artificial intelligence and has petitioned against autonomous weapons.\n- He is optimistic about AI's impact on the job market but believes that AGI won't make humans redundant.\n- Hinton lost his second wife to ovarian cancer in 1994.", "George Novacky": "\n\n- George A. Novacky was an Assistant Department Chair and Senior Lecturer in Computer Science, and an Assistant Dean of CAS for Undergraduate Studies at the University of Pittsburgh.\n- He received a mathematics degree from Wheeling Jesuit College in 1968, followed by an MA in mathematics in 1971 and a PhD in mathematics in 1981 from the University of Pittsburgh.\n- Novacky's dissertation was on the chromaticity of extremal graphs.\n- He was an Associate Professor of Mathematics at the Community College of Allegheny County from 1977 to 1985.\n- He has been a faculty member of the University of Pittsburgh's Department of Computer Science since 1985.\n- Novacky received The Chancellor's Distinguished Teaching Award in 1993.\n- He has published three books including \"Computers and Networks: A Laboratory Approach to Computer Literacy\", \"Computer Applications & the Internet\" (co-authored with Y. Khalifa), and \"PDA Programming in C\" (co-authored with Yasir Khalifa).", "George Sadowsky": "\n\n- George Sadowsky is an American computer scientist who has worked extensively in developing countries to bring affordable internet and minimize government control and regulation.\n- He was inducted into the Internet Hall of Fame as a Global Connector in 2013 and received the Johnathan B. Postel award in 2022.\n- Sadowsky has a background in mathematics and economics, with degrees from Harvard and Yale.\n- He held various roles in academia and research, including Director of Academic Computing and Network Services at New York University and Executive Director of the GIPI project.\n- Sadowsky served on various boards, including the Nominating Committee of ICANN, the Board of Directors for the Digital Policy Institute, and the IT Advisory Council for Bulgarian President Georgi Parvanov.\n- He has also been a member of the Election Committee of the Internet Society and serves on the Board of Directors of Peoplink and the Board of Advisers of Bridge to Asia.", "Gerald Jay Sussman": "- Gerald Jay Sussman is the Panasonic Professor of Electrical Engineering at MIT\n- He received his S.B. and Ph.D. degrees in mathematics from MIT\n- Sussman has been involved in AI research since 1964\n- His research focuses on problem-solving strategies and formalizing them for more effective education\n- Sussman has worked in computer languages, computer architecture, and Very Large Scale Integration (VLSI) design\n- Sussman co-authored the computer science textbook Structure and Interpretation of Computer Programs\n- He has made contributions to AI in problem-solving, CAD, and electrical circuit analysis and synthesis\n- Sussman co-invented the programming language Scheme with Guy L. Steele Jr.\n- He is a fellow of several organizations including the IEEE and the ACM and has received multiple teaching awards\n- Sussman is also involved in the free software movement and is a bonded locksmith and member of various organizations including the AWI and the ARRL\n- Sussman is married to computer programmer Julie Sussman\n- A selection of his bibliography is listed, including Structure and Interpretation of Computer Programs and Structure and Interpretation of Classical Mechanics", "Gerard Holzmann": "\n\n- Gerard J. Holzmann is a Dutch-American computer scientist and researcher at Bell Labs and NASA.\n- He received an Engineer's degree and PhD from Delft University of Technology.\n- He worked as an assistant professor at Delft University and at Bell Labs in the Computing Science Research Center.\n- He joined NASA in 2003 and leads the NASA JPL Laboratory for Reliable Software.\n- Holzmann created the SPIN model checker in the 1980s, which can verify the correctness of concurrent software.\n- He has received various awards, including the Prof. Bahler Prize, the Software System Award, and the IEEE Harlan D. Mills Award.\n- Holzmann has published several books, including The Spin Model Checker - Primer and Reference Manual and Design and Validation of Computer Protocols.", "Gerard Salton": "- Gerard A. \"Gerry\" Salton was a Professor of Computer Science at Cornell University and the \"father of Information Retrieval\"\n- He developed the SMART Information Retrieval System, which was the first system to use the vector space model for Information Retrieval\n- Salton was born in Germany and received a Bachelor's and Master's degree in mathematics from Brooklyn College, and a Ph.D. from Harvard in applied mathematics\n- He is best known for developing the vector space model and TF-IDF (term-frequency-inverse-document frequency) for Information Retrieval\n- He published over 150 research articles and 5 books during his life and was editor-in-chief of the Communications of the ACM and the Journal of the ACM\n- Salton was an ACM Fellow, received an Award of Merit from the American Society for Information Science, and was the first recipient of the SIGIR Award for outstanding contributions to the study of Information Retrieval (now called the Gerard Salton Award)\n- Bibliography includes \"Automatic Information Organization and Retrieval,\" \"A Theory of Indexing,\" and \"Automatic Text Processing\"\n- See also: List of pioneers in computer science", "Gernot Heiser": "\n\n- Gernot Heiser is a Scientia Professor and the John Lions Chair for operating systems at UNSW Sydney.\n- He joined UNSW Sydney in 1991 as a lecturer and became a full professor in 2002, a position he still holds.\n- He co-led NICTA's Embedded, Real-Time and Operating Systems program from its inception in 2002 to its transformation into the Software Systems Research Group in 2011, which he led.\n- He is the founding chairman of the seL4 Foundation since April 2020.\n- He focuses his research on microkernels, microkernel-based systems, and virtual machines, emphasizing performance and reliability.\n- His group developed Mungi, a single address space operating system for clusters and implementations of the L4 microkernel with fast IPC communication.\n- His research shifted towards embedded systems at NICTA, leading to the development of the seL4 microkernel and its formal verification for functional correctness.\n- He has worked on paravirtualization, device drivers, virtual NUMA, energy management, and microarchitectural timing channels.\n- He has received various awards and recognitions, such as the ACM SIGOPS Hall of Fame Award in 2019 and the NSW Scientist of the Year award in 2009.", "Gerrit Blaauw": "- Gerrit Anne \"Gerry\" Blaauw was a Dutch computer scientist who played a major role in the design of the IBM System/360 line of computers.\n- He received his BA from Delft University of Technology and his MA and PhD from Harvard University.\n- Blaauw worked for IBM and designed the unsuccessful IBM 8000 series, but was a key engineer on the successful IBM System/360 project.\n- He designed the revolutionary address translation system, the \"Blaauw Box\", which was later used in IBM's unsuccessful proposal to MIT's Project MAC and in the IBM System/360-67 computer.\n- After leaving IBM, Blaauw became a computer science professor and retired from the University of Twente in 1989 as professor emeritus.\n- Blaauw was a devout Christian and explored science and faith in a booklet available in English, Dutch, and Spanish.\n- Selected publications by Blaauw include Digital System Implementation (1976) and Computer Architecture: Concepts and Evolution (1997).\n- Blaauw died in Utrecht in 2018.", "Gillian Lovegrove": "- Gillian Lovegrove is a retired computer scientist and academic.\n- Lovegrove was Dean of the School of Informatics at Northumbria University.\n- She was president of the Conference of Professors and Heads of Computing and a Higher Education consultant to the British Computer Society.\n- Lovegrove is known for her interest in gender imbalance in computer education and employment and for discussing solutions to a shortage of information technology graduates in the UK.\n- Lovegrove studied at Newnham College, Cambridge and started her career as a lecturer in mathematics at Portsmouth Polytechnic.\n- Lovegrove conducted research on object-oriented computing and co-wrote two papers about girls and computer education.\n- Lovegrove organised \"Women into Computing\" conferences in the late 1980s.\n- Lovegrove was associate dean and head of information systems at the University of Staffordshire's School of Computing.\n- Lovegrove gave evidence on the shortage of IT graduates to the Parliamentary Information Technology Committee in 2001 and proposed joint teaching schemes between employers and universities.\n- Lovegrove was head-hunted by Northumbria University in 1999 to be Head of the School of Informatics.", "Gio Wiederhold": "\n\n- Gio Wiederhold was a computer scientist who spent most of his career at Stanford University.\n- He focused his research on the design and protection of large-scale database management systems, often using knowledge-based techniques.\n- Wiederhold was born in Italy in 1936 and emigrated to the United States in 1958.\n- He worked on short-range missile trajectories at NATO's Air Defense Technical Center and at IBM's service bureau before joining UC Berkeley in 1962 to develop incremental compiling technology.\n- Wiederhold joined the faculty of Stanford University in 1976 and integrated knowledge base technology with artificial intelligence concepts to provide intelligent and efficient access to databases.\n- He authored several books on database management systems and was named a fellow of various organizations such as the American College of Medical Informatics, the Institute of Electrical and Electronics Engineers, and the Association for Computing Machinery.\n- In later career, Wiederhold worked on various projects such as model-based transformation of relational database information, architectural concepts for mediators, and a high-level programming language for software composition.\n- He retired in 2001 and continued to work as a consultant for the U.S. Treasury on assessing the values of intellectual property exported from the U.S. as part of offshoring.\n- Wiederhold authored and coauthored over 400 published papers and reports and received an honorary doctorate from NUI Galway in 2011.\n- He died on December 26, 2022, at the age of 86.", "Glen Culler": "- Glen Jacob Culler was an American professor of electrical engineering\n- He was an early innovator in the development of the Internet\n- He joined the University of California, Santa Barbara (UCSB) faculty in 1959\n- He helped put the campus in the forefront of computer science\n- He later founded his own company, Culler-Harrison, which became CHI Systems and later Culler Scientific\n- His son David Culler is also a notable computer scientist\n- He developed the Culler-Fried Online System, one of the first interactive computer systems\n- The system used a storage oscilloscope for graphical information and provided an innovative means of teaching mathematical concepts\n- He was chosen by ARPA to be one of the first four nodes on the original ARPANET in 1969\n- Culler-Harrison is considered a precursor to the founding of Floating Point Systems, Inc. and the Very Long Instruction Word (VLIW) architecture\n- He received the National Medal of Technology from President Bill Clinton in 2000\n- He was also a recipient of the Seymour Cray Computer Science and Engineering Award from the IEEE.", "Gloria Townsend": "\n\n- Gloria Townsend is an American computer scientist and professor.\n- She works at DePauw University in Indiana.\n- She is known for her work in evolutionary computation and her involvement with women in computing.\n- Townsend has served on the Executive Committee of the Association for Computing Machinery (ACM) Council on Women in Computing.\n- She is the author of One Hundred One Ideas for Small Regional Celebrations of Women in Computing.\n- She received the Mr. and Mrs. Fred C. Tucker Jr. Distinguished Career Award in 2013.\n- In 2006, she organized regional celebrations of Women in Computing to coincide with the Grace Hopper Celebration of Women in Computing conference.\n- In 2010, the celebrations were extended to 12 regions as a joint effort by ACM-W, ABI, and NCWIT.\n- Townshend has published papers on topics such as general education courses, mentors and role models, and leveling the CS1 playing field.\n- She is affiliated with the Association for Computing Machinery's Council on Women in Computing (ACM-W).", "Godfried Toussaint": "\n\n- Godfried Theodore Patrick Toussaint was a Canadian computer scientist and a professor of computer science at New York University Abu Dhabi.\n- He is considered to be the father of computational geometry in Canada and conducted research on various aspects of computational and discrete geometry.\n- Toussaint was a co-founder of the Annual ACM Symposium on Computational Geometry and the Annual Canadian Conference on Computational Geometry.\n- He developed the Akl-Toussaint algorithm for the construction of the convex hull of a planar point set.\n- Toussaint applied mathematical methods to the analysis of symbolically represented music and discovered the Euclidean algorithm for computing the greatest common divisor of two numbers implicitly generates almost all the most important traditional rhythms of the world.\n- He was the recipient of several prestigious awards for his contributions to the field of computer science.\n- Toussaint authored several books and book chapters on topics in computational geometry and computer science.", "Gordon Bell": "- Chester Gordon Bell is an American electrical engineer and manager\n- He worked at Digital Equipment Corporation (DEC) from 1960 to 1966, designing several PDP machines and becoming Vice President of Engineering from 1972 to 1983, overseeing the development of the VAX computer systems\n- He later became an entrepreneur and investor, founding Encore Computer and Ardent Computer, and established the Gordon Bell Prize in 1987 to encourage development in parallel processing\n- Bell also became involved in public policy, becoming the founding Assistant Director of the CISE Directorate of the NSF in the 1980s\n- He later became a researcher emeritus at Microsoft Research from 1995 to 2015, working on the MyLifeBits project\n- Bell was elected a member of the National Academy of Engineering in 1977 and has received several other honors and awards throughout his career\n- He is also a co-founder of the Computer History Museum and has authored several books.", "Gordon Cormack": "\n\n- Gordon Villy Cormack is a professor at the University of Waterloo.\n- He co-invented Dynamic Markov Compression.\n- His research with Maura R. Grossman has been cited in legal cases in the US, Ireland, and the UK.\n- Since 2001, he has been a program committee member of The Text Retrieval Conference.\n- Cormack coached Waterloo's ACM International Collegiate Programming Contest team from 1997-2010.\n- He was a member of the International Olympiad in Informatics Scientific Committee from 2004-2011.\n- Cormack received his education from University of Manitoba and was a faculty member at McGill University before joining the University of Waterloo.", "Gordon Moore": "- Gordon Earle Moore is an American businessman, engineer, and co-founder of Intel Corporation.\n- He is the original proponent of Moore's law, which predicts that the number of components in a dense integrated circuit doubles approximately every two years.\n- Moore studied chemistry and physics at the University of California, Berkeley, and received a Ph.D. in chemistry from the California Institute of Technology.\n- He worked at Fairchild Semiconductor before co-founding Intel Corporation with Robert Noyce in 1968.\n- He has a net worth of $7 billion as of February 2023.\n- Moore and his wife established the Gordon and Betty Moore Foundation in 2000, through which they support environmental conservation, science, and nursing care.\n- Moore has received many awards and honors for his contributions to the semiconductor industry, including the National Medal of Technology and Innovation, Presidential Medal of Freedom, IEEE Medal of Honor, and Dan David Prize.\n- He is also an avid sport fisherman and conservationist.", "Greg Nelson (computer scientist)": "\n\n- Charles Gregory Nelson was an American computer scientist born on 27 March 1953 and died on 2 February 2015.\n- He grew up in Honolulu and had a talent for gymnastics and tennis.\n- He received his B.A. degree in mathematics from Harvard University in 1976 and his Ph.D. in computer science from Stanford University in 1980 under the supervision of Robert Tarjan.\n- His thesis was titled \"Techniques for Program Verification\".\n- He contributed to program verification, automated theorem proving, and satisfiability modulo theories.\n- He received the Herbrand Award in 2013 for his pioneering contributions to theorem proving and program verification.\n- He played a key role in developing the Simplify theorem prover.\n- He made significant contributions in programming language design, distributed systems, constraint-based graphics editors, windowing systems, optimal code generation, and multi-threaded programming.\n- He settled permanently in the San Francisco Bay Area after living in Juneau, Alaska for a year.\n- He is listed in the Wikipedia articles: List of computer scientists and List of programmers.", "Gregor Kiczales": "\n\n- Gregor Kiczales is a computer scientist and full time professor at the University of British Columbia in Vancouver, Canada.\n- He is best known for developing the concept of aspect-oriented programming and the AspectJ extension to the Java programming language.\n- He is a co-author of the specification for the Common Lisp Object System and authored the book The Art of the Metaobject Protocol.\n- Kiczales' work focuses on allowing software engineers to create programs that look like their design to reduce complexity and improve software quality.\n- He started his research career at the MIT Lab for Computer Science and later joined the Xerox Palo Alto Research Center where he developed his most important research works.\n- Kiczales left PARC in 1999 to focus on computer science education and joined the Department of Computer Science at the University of British Columbia in 2000.\n- He designed CPSC 110, the introductory programming course in the UBC curriculum, which focuses on systematic program design by means of design recipes.\n- Kiczales co-founded Intentional Software with Charles Simonyi in 2002 but left in 2003 to return to UBC.\n- In 2012, he won the Senior AITO Dahl-Nygaard Prize for his work on the Common Lisp Object System and was named an ACM Fellow.\n- He was appointed executive director of UBC Extended Learning in July 2017.", "Gregory Chaitin": "- Gregory John Chaitin is a mathematician and computer scientist.\n- He made contributions to algorithmic information theory and metamathematics.\n- He is considered one of the founders of algorithmic complexity.\n- Chaitin's constant Ω is a real number with properties that make it definable but not computable.\n- He is also interested in questions of metabiology and information-theoretic formalizations of the theory of evolution.\n- Chaitin has written books on philosophy, including metaphysics and philosophy of mathematics.\n- He defends a position known as digital philosophy and proposes a quasi-empirical methodology in mathematics.\n- He has received several honors, including degrees of doctor of science and professorship.\n- Chaitin's interpretations and conclusions have been subject to criticism and disagreement from some philosophers and logicians.\n- He has published several books and articles on his work and ideas.\n- Chaitin's work draws attention from computer scientists, philosophers, and mathematicians alike.", "Grzegorz Rozenberg": "- Grzegorz Rozenberg is a computer scientist from Poland and the Netherlands.\n- His primary research areas include natural computing, formal language and automata theory, graph transformations, and concurrent systems.\n- He is known as the \"guru of natural computing\" for promoting the discipline and giving it its current name and scope in the 1970s.\n- Rozenberg has been a professor at Leiden University in the Netherlands since 1979 and is also an adjoint professor at the University of Colorado at Boulder in the US.\n- He has authored over 500 papers and 6 books, and co-edited over 100 books and special issues of scientific journals.\n- Rozenberg founded or co-founded and served as the chair for several computer science conferences and organizations.\n- He has received numerous honors and awards for his contributions to computer science, including being named a Foreign Member of the Finnish Academy of Sciences and Letters and being appointed Knight in the Order of the Netherlands Lion.\n- Rozenberg is also a performing magician under the name Bolgani and is the father of Dutch artist Dadara.", "Guido van Rossum": "\n\n- Guido van Rossum is a Dutch programmer who created the Python programming language.\n- He was the \"benevolent dictator for life\" of Python until he stepped down from the position in 2018.\n- Van Rossum received a master's degree in mathematics and computer science from the University of Amsterdam in 1982.\n- He worked for various research institutes, including the Centrum Wiskunde & Informatica in the Netherlands, the U.S. National Institute of Standards and Technology, and the Corporation for National Research Initiatives.\n- From 2005 to 2012, he worked at Google, where he spent half of his time developing Python and created the web-based code review system Mondrian.\n- In 2013, he joined Dropbox and officially retired in 2019.\n- In 2020, he announced that he was coming out of retirement to join the Developer Division at Microsoft as a Distinguished Engineer.\n- Van Rossum submitted a funding proposal to DARPA in 1999 called \"Computer Programming for Everybody,\" in which he further defined his goals for Python, including making it an easy and intuitive language, open source, and suitable for everyday tasks.\n- He has received various awards, including the 2001 Award for the Advancement of Free Software from the Free Software Foundation and the 2018 Fellow of the Computer History museum.", "Guy L. Steele, Jr.": "- Guy Lewis Steele Jr. is an American computer scientist who played a key role in designing and documenting several computer programming languages and technical standards.\n- He received his education from Harvard University and the Massachusetts Institute of Technology (MIT).\n- Steele worked at various organizations, including Carnegie Mellon University, Tartan Laboratories, Thinking Machines, Sun Microsystems, and Oracle.\n- He has contributed to the design of Lisp and its implementation, the Scheme language, the command set of Emacs, and the development of TeX.\n- Steele served on accredited technical standards committees, including the X3J11 for C, X3J3 for Fortran, Ecma International (formerly European Computer Manufacturers Association (ECMA)) TC39 for ECMAScript, and X3J13 for Common Lisp.\n- He coauthored several books, including \"The Hacker's Dictionary,\" \"C: A Reference Manual,\" \"Common Lisp the Language,\" \"The High Performance Fortran Handbook,\" and \"The Java Language Specification.\"\n- Steele received multiple awards and honors throughout his career, including the ACM Grace Murray Hopper Award and being named an ACM Fellow, a member of the National Academy of Engineering of the United States of America, and a Fellow of the American Academy of Arts and Sciences.\n- He is also a modern western square dancer and has published light verse and \"Crunchly\" cartoons under the pseudonym Great Quux.", "Gábor Tardos": "\n\n- Gábor Tardos is a Hungarian mathematician.\n- He is currently a professor at Central European University and was previously a Canada Research Chair at Simon Fraser University.\n- Tardos works mainly in combinatorics and computer science.\n- He received his PhD in Mathematics from Eötvös University, Budapest in 1988 and held postdoctoral posts at the University of Chicago, Rutgers University, University of Toronto, and the Princeton Institute for Advanced Study.\n- Tardos received several awards, including the European Mathematical Society prize for young researchers, the Prize of the Hungarian Academy of Sciences for Young Researchers, the Erdős Prize from the Hungarian Academy of Sciences, and the Alfréd Rényi Prize.\n- He received a Lendület Grant from the Hungarian Academy of Sciences in 2009, and in 2020, he received the Gödel Prize for the algorithmic version of the Lovász local lemma that he developed with Robin Moser.\n- Tardos is the younger brother of Éva Tardos, who is also a renowned mathematician.\n- Tardos worked on several mathematical results, including exhibiting a maximal clone of order-preserving operations that is not finitely generated, obtaining partial results concerning the Hanna Neumann conjecture, and proving a combinatorial conjecture of Zoltán Füredi and Péter Hajnal that was known to imply the Stanley–Wilf conjecture.\n- He also developed a method for optimal probabilistic fingerprint codes and worked out an algorithm that is easy to implement.\n- Tardos was an invited speaker at the International Congress of Mathematicians in Rio de Janeiro in 2018.\n- His selected publications include papers on optimal probabilistic fingerprint codes, transversals of 2-intervals, on the power of randomization in on-line algorithms, and a maximal clone of monotone operations which is not finitely generated.", "Hans Moravec": "\n\n- Hans Peter Moravec is a futurist and adjunct faculty member at the Robotics Institute of Carnegie Mellon University.\n- He is known for his work on robotics, artificial intelligence, and the impact of technology.\n- Moravec developed techniques in computer vision for determining the region of interest in a scene.\n- He received his BSc in mathematics from Acadia University and his MSc in computer science from the University of Western Ontario.\n- His PhD thesis at Stanford University involved a TV-equipped robot that could negotiate cluttered obstacle courses.\n- Moravec co-founded Seegrid Corporation, a robotics company.\n- In his book Mind Children, he predicts the evolution of robots into a new species, starting around 2030-2040.\n- Moravec also outlined the \"neural substitution argument\" in Mind Children, which suggests that consciousness does not depend on biology and can be transferred to an electronic computer.\n- In his book Robot: Mere Machine to Transcendent Mind, he predicts a coming \"mind fire\" of rapidly expanding superintelligence.\n- Moravec's work is related to artificial general intelligence, mind uploading, simulated reality, space elevators, and the technological singularity.", "Hans Zantema": "\n\n- Hans Zantema is a Dutch mathematician and computer scientist.\n- He is a professor at Radboud University in Nijmegen.\n- Zantema received his PhD in algebraic number theory at the University of Amsterdam in 1983.\n- He worked in the computer science industry from 1987 to 2000 at Utrecht University and since 2000 at Eindhoven University of Technology.\n- Zantema's main achievements are in term rewriting systems, specifically in proving termination.\n- He is known for Zantema's problem, which asks if the string rewrite system 0011 -> 111000 terminates.\n- Selected publications include his PhD thesis and articles on termination of term rewriting. \n- Zantema's homepage can be found on the website of his university.", "Hardik Gohel": "\n\n- Hardik Gohel is a computer scientist and educational leader.\n- He is a faculty member and director of Applied Artificial Intelligence(AAI) laboratory at University of Houston at Victoria (UHV).\n- Gohel is the AI/ML research faculty at University of Houston Hewlett Packard Enterprise Data Science Institute.\n- He is also a Senior Member of the Institute of Electrical and Electronics Engineers (IEEE) and executive faculty advisor of an international science group at UHV.\n- Gohel has research experience in artificial intelligence, digital healthcare, cybersecurity, and advanced computing.\n- He has received his Ph.D. in computer science from University of Hertfordshire, England, and his bachelor's and master's degree in computer science from Saurashtra University and Sardar Patel University, India.\n- Gohel has 70 publications in the journals and proceedings of national and international conferences.\n- He has received various grants, including postdoctoral travel grant, summer research grant, and multiyear collaborative federal STEM grant.\n- In 2022, UHV has received the first federal contract for research, and Gohel is the principal investigator on this project.\n- Gohel has formed a UHV student branch of the Institute of Electrical and Electronics Engineers (IEEE), and he is associated with virtual converges of international tech communities by webinars and virtual datascience summer bootcamps for high school students.\n- Gohel has authored several books on topics such as data visualization, computational approaches for novel therapeutic and diagnostic designing, and Introduction to Network & Cyber Security.\n- He has received academic and research excellence awards from Computer Society of India, and senior membership from the Institute of Electrical and Electronics Engineers (IEEE).", "Harry Bouwman": "\n\n- Willem Adriaan Gerrit Anton Bouwman is a Dutch Information systems researcher and professor at Åbo Akademi University.\n- Bouwman has worked on mobile services, business models, and business architecture.\n- He holds an MA in political science from VU University Amsterdam, a PhD from Radboud University Nijmegen, and a degree in computer science from Open University in the Netherlands.\n- Bouwman has been an assistant professor at the University of Amsterdam and an associate professor at the University Utrecht and Delft University of Technology.\n- He has also been a visiting professor at Syracuse University and Northwestern University.\n- Bouwman is the author of books such as \"Mobile Service Innovation and Business Models\" and \"Information and Communication Technology in Organizations: Adoption, Implementation, Use and Effects\".\n- He has also contributed to articles on topics such as click-and-mortar electronic commerce, advanced mobile services acceptance, and business architecture.", "Haskell Curry": "- Haskell Brooks Curry was an American mathematician and logician born on September 12, 1900, in Millis, Massachusetts.\n- Curry is best known for his work in combinatory logic and his development of the concept.\n- Curry's work focused on attempts to show that combinatory logic could provide a foundation for mathematics.\n- He also played a significant role in high-level programming language and the development of a procedure to convert general arithmetic expression into computer code.\n- Curry taught at Harvard, Princeton, and Pennsylvania State University for most of his career and retired from the University of Amsterdam in 1970.\n- He published major works such as \"Foundations of Mathematical Logic\" and \"Combinatory Logic.\"\n- Curry died on September 1, 1982, in State College, Pennsylvania.\n- Haskell, Brook, and Curry, three programming languages, are named after him along with the concept of currying used for functions in math and computer science.", "Hector Garcia-Molina": "- Héctor García-Molina was a Mexican-American computer scientist and professor at Stanford University.\n- He advised Google co-founder Sergey Brin from 1993 to 1997 when Brin was a student at Stanford.\n- García-Molina received his bachelor's degree in Electrical Engineering from the Monterrey Institute of Technology and Higher Studies (ITESM) and both a master's degree in Electrical Engineering and a doctorate in Computer Science from Stanford University.\n- He worked at Princeton University from 1979 to 1991 before joining the faculty of Stanford University in 1992.\n- García-Molina served on the U.S. President's Information Technology Advisory Committee (PITAC) and was a member of Oracle Corporation's Board of Directors.\n- He received various awards, including the VLDB 10-year Best Paper Award, SIGMOD Best Demo Award, and an honorary doctorate from ETH Zurich.\n- García-Molina died of cancer at the age of 65.", "Herbert W. Franke": "\n\n- Herbert W. Franke was an Austrian scientist and writer who was born on 14 May 1927 and died on 16 July 2022\n\n- He was known as \"the most prominent German writing Science Fiction author\"\n\n- Franke was an early computer artist who created computer graphics and early digital art starting from the late 1950s\n\n- He was also active in the fields of future research and speleology\n\n- Franke used his pen name Sergius Both as his Avatar name in Active Worlds and Opensimulator grids\n\n- The Sergius Both Award is given for creative scripting in Immersionskunst by Stiftung Kunstinformatik\n\n- Franke received his doctorate in theoretical physics in 1950\n\n- He was a co-founder of Ars Electronica in Linz, Austria\n\n- Franke held a lectureship in \"Cybernetical Aesthetic\" at Munich University from 1973 to 1997\n\n- Some of Franke's well-known publications include \"The Magic of Molecules,\" \"The Orchid Cage,\" and \"The Mind Net\"\n\n- Franke won several awards, including the Deutscher Science Fiction Preis, the Kurd Lasswitz prize, and the Austrian Cross of Honour for Science and Art, 1st class\n\n- His works are part of museum collections such as the Abteiberg Museum and the Victoria and Albert Museum\n\n- Herbert W. Franke's archive is at ZKM | Center for Art and Media Karlsruhe."}