{"Aaron Sloman": "- Aaron Sloman is a philosopher and researcher on artificial intelligence and cognitive science\n- He held the Chair in Artificial Intelligence and Cognitive Science at the School of Computer Science at the University of Birmingham and previously at the University of Sussex\n- Sloman has published widely on philosophy of mathematics, epistemology, cognitive science, and artificial intelligence and collaborated with biologist Jackie Chappell on the evolution of intelligence\n- He was born in Southern Rhodesia (now Zimbabwe) to Lithuanian Jewish parents, and went to school in Cape Town before earning a degree in Mathematics and Physics at the University of Cape Town and a DPhil in philosophy at the University of Oxford\n- Sloman's philosophical ideas were influenced by Immanuel Kant, Gottlob Frege, Karl Popper and others, and his work in AI by Marvin Minsky and John McCarthy\n- He is a Fellow of several AI and philosophy associations and received the K. Jon Barwise Prize for contributions to philosophy and computing from the American Philosophical Association in 2020\n- Sloman has published numerous papers and presentations, including The Computer Revolution in Philosophy, which emphasized the importance of architectures in AI and philosophy", "Abhay Bhushan": "\n\n- Abhay Bhushan Pandey is an Indian computer scientist.\n- He made significant contributions to the development of the Internet TCP/IP architecture.\n- He is the author of the File Transfer Protocol and early versions of email protocols.\n- He graduated from the first batch of Indian Institute of Technology Kanpur in 1965 with a B.Tech in electrical engineering.\n- He received a Masters in electrical engineering and a degree in Management from the MIT Sloan School of Management.\n- He worked on developing FTP and email protocols for ARPANet and subsequent Internet.\n- He was a Director at the Institute of Engineering and Rural Technology in Allahabad and a senior manager in Engineering and Development of Xerox.\n- He was a co-founder of YieldUP International and Portola Communications.\n- He is currently chairman of Asquare Inc., Secretary of Indians for Collective Action and former President of the IIT-Kanpur Foundation.", "Adam Dunkels": "- Adam Dunkels is a Swedish computer scientist and entrepreneur\n- He is the founder of Thingsquare, an Internet of things product development business\n- Dunkels focuses on computer networking technology and distributed communication for small embedded systems and devices\n- He attended the Swedish Institute of Computer Science, earning a B.S., M.S., and Ph.D.\n- Dunkels is known for his work on the uIP and lwIP TCP/IP Internet protocol suite and for inventing protothreads and the operating system Contiki\n- He co-authored the book Interconnecting Smart Objects with IP: the Next Internet and founded the Internet Protocol for Smart Objects Alliance\n- Dunkels has received various awards for his work, including the TR35 list of top innovators under 35 and the ACM SIGOPS EuroSys Roger Needham PhD award\n- His small implementations have been used in commercial products by companies such as ABB, Cisco Systems, and Volvo Technology\n- Some of his notable implementations include Protothreads, uIP, Contiki, and lwIP.", "Adele Goldberg (computer scientist)": "- Adele Goldberg is an American computer scientist, born July 22, 1945 in Cleveland, Ohio.\n- She co-developed the programming language Smalltalk-80 and various concepts related to object-oriented programming at Xerox Palo Alto Research Center (PARC) in the 1970s.\n- Goldberg earned a bachelor's degree in mathematics at the University of Michigan in 1967, and a master's (1969) and PhD (1973) in information science at the University of Chicago, where she completed her dissertation while working at Stanford University.\n- Goldberg served as manager of the System Concepts Laboratory at PARC, where she developed Smalltalk-80 with Alan Kay and other researchers, introducing a programming environment of overlapping windows on graphic display screens.\n- Many of Goldberg's concepts became the basis for graphical user interfaces, and Steve Jobs demanded a demonstration of the Smalltalk System before incorporating ideas into Apple's Macintosh environment.\n- Goldberg left PARC in 1988 to cofound ParcPlace Systems, a company that created development tools for Smalltalk-based applications, and cofounded Neometron, Inc. in 1999, an Internet support provider.\n- Goldberg has received numerous awards and honors, including the ACM Software Systems Award in 1987 and admission to the Women in Technology International Hall of Fame in 2010.\n- The Computer History Museum has a collection of Goldberg's working documents, reports, publications, and videos related to her work on Smalltalk.\n- Goldberg's publications include books on Smalltalk-80: The Language and Its Implementation (1983), The Interactive Programming Environment (1983), and The Language (1989).", "Adi Shamir": "\n\n- Adi Shamir is an Israeli cryptographer.\n- He co-invented the RSA algorithm with Ron Rivest and Len Adleman.\n- He is also a co-inventor of the Feige-Fiat-Shamir identification scheme with Uriel Feige and Amos Fiat.\n- He has made contributions to the field of cryptography and computer science, including the discovery of differential cryptanalysis.\n- He received a BSc in mathematics from Tel Aviv University and an MSc and PhD in Computer Science from the Weizmann Institute.\n- He has received numerous awards and honors, including the ACM Turing Award, the Paris Kanellakis Theory and Practice Award, and the Japan Prize in the field of Electronics, Information and Communication.\n- He was elected a Foreign Member of the Royal Society (ForMemRS) and a Member of the American Philosophical Society.", "Adriaan van Wijngaarden": "\n\n- Adriaan \"Aad\" van Wijngaarden was a Dutch mathematician and computer scientist who promoted the mathematical aspects of computing.\n- He received a degree in mechanical engineering from Delft University of Technology in 1939.\n- Van Wijngaarden became head of the Computing Department of the Mathematisch Centrum (MC) in Amsterdam in 1947.\n- He worked on the construction of the first Dutch computer, the ARRA, in 1952.\n- Van Wijngaarden was one of the designers of the original ALGOL language and later ALGOL 68.\n- He developed a two-level type of formal grammar known as a Van Wijngaarden grammar.\n- In 1962, he became a member of the International Federation for Information Processing (IFIP) IFIP Working Group 2.1 on Algorithmic Languages and Calculi.\n- The Van Wijngaarden Awards are named in his honor and are awarded every 5 years from the 60th anniversary of the Centrum Wiskunde & Informatica in 2006.\n- Four individuals have been awarded the Van Wijngaarden Awards so far: Nancy Lynch, Persi Diaconis, Éva Tardos, John C. Butcher, Xavier Leroy, Sara van de Geer, Marta Kwiatkowska, and Susan Murphy.\n- Van Wijngaarden died on February 7, 1987.", "Alan Dix": "\n\n- Alan John Dix is a British author, researcher, and university professor specializing in human-computer interaction (HCI).\n- He is one of the four co-authors of the university-level textbook Human-Computer Interaction.\n- Dix is the Director of the Computational Foundry at Swansea University since May 2018.\n- He was previously a professor at Lancaster University.\n- Dix has authored several books, including Human-Computer Interaction (1st, 2nd, and 3rd editions) and Formal Methods for Interactive Systems.\n- He has also contributed to the book People and Computers III with a chapter titled \"Myth of the Infinitely Fast Machine.\"\n- Additionally, Dix has a personal website and has been a part of the International Mathematical Olympiad.", "Alan Edelman": "\n\n- Alan Stuart Edelman is a mathematician and computer scientist.\n- He is a professor of applied mathematics at MIT and a Principal Investigator at the MIT Computer Science and Artificial Intelligence Laboratory (CSAIL).\n- In 2004, he founded Interactive Supercomputing which was later acquired by Microsoft.\n- Edelman is a fellow of various prestigious societies and academies in the field such as American Mathematical Society, Society for Industrial and Applied Mathematics, Institute of Electrical and Electronics Engineers, and Association for Computing Machinery.\n- His research interests include high-performance computing, numerical computation, linear algebra, and random matrix theory.\n- Edelman is known for his contributions to the Julia programming language, parallel computing, and the Future Fast Fourier transform.\n- He has received numerous awards for his research including the Gordon Bell Prize, Chauvenet Prize, and Lester R. Ford Award, among others.\n- He became a Fellow of SIAM in 2011, the American Mathematical Society in 2015, an IEEE Fellow Class in 2018, and an ACM Fellow of Class 2020.\n- Edelman’s contributions to random matrix theory and numerical linear algebra are notable.", "Alan Kay": "- Alan Curtis Kay is an American computer scientist.\n- He is known for his pioneering work on object-oriented programming and windowing graphical user interface design.\n- He led the design and development of the first modern windowed computer desktop interface at Xerox PARC.\n- He also led the development of the influential object-oriented programming language Smalltalk.\n- He has been elected a Fellow of the American Academy of Arts and Sciences, the National Academy of Engineering, and the Royal Society of Arts.\n- He received the Turing award in 2003.\n- Kay is a former professional jazz guitarist, composer, and theatrical designer.\n- He is also an amateur classical pipe organist.\n- Kay attended the University of Utah College of Engineering and worked with David C. Evans and Ivan Sutherland.\n- He joined the Xerox PARC research staff in Palo Alto, California in 1970.\n- Kay conceived the Dynabook concept, a key progenitor of laptop and tablet computers and the e-book.\n- He has worked as Chief Scientist at Atari and an Apple Fellow.\n- Kay founded the Viewpoints Research Institute in 2001, a nonprofit organization dedicated to children, learning, and advanced software development.\n- He collaborated with others to start the open source Squeak version of Smalltalk.\n- Kay has lectured extensively on the idea that the computer revolution is very new, and all of the good ideas have not been universally implemented.\n- He has received many awards and honors, including the ACM Turing Award and honorary doctorates from several universities.", "Alan Mycroft": "\n\n- Alan Mycroft is a professor at the Computer Laboratory, University of Cambridge.\n- He is a Fellow of Robinson College, Cambridge, and the director of studies for computer science.\n- Mycroft completed his PhD in Edinburgh with a thesis on Abstract interpretation and optimising transformations for applicative programs.\n- His research interests are in programming languages, software engineering, and algorithms.\n- Mycroft co-created the Norcroft C compiler with Arthur Norman.\n- He is also a named trustee of the Raspberry Pi Foundation, a charitable organization that promotes basic computer science education.\n- Mycroft has four children.", "Alan Perlis": "\n\n- Alan Jay Perlis was an American computer scientist and professor at Purdue University, Carnegie Mellon University, and Yale University.\n- He was born in Pittsburgh in 1922 and received his bachelor's degree in chemistry from Carnegie Institute of Technology in 1943.\n- He earned a master's and Ph.D. in mathematics at MIT and wrote his dissertation on \"Integral Equations, Their Solution by Iteration and Analytic Continuation.\"\n- Perlis participated in Project Whirlwind in 1952 and was eventually appointed the first head of the computer science department at Carnegie Mellon University.\n- In 1962, he was elected president of the Association for Computing Machinery and won the first Turing Award in 1966 for his work on the programming language ALGOL and Internal Translator.\n- Perlis moved to Yale University in 1971 to take the chair of computer science and was elected to the National Academy of Engineering in 1977.\n- He wrote an article, \"Epigrams on Programming,\" in 1982, distilling his programming wisdom into one-sentence quotes.\n- He passed away in 1990 and left behind a notable list of publications, including \"An Introductory Course in Computer Programming\" and \"In Praise of APL: A Language for Lyrical Programming.\"", "Alberto Ciaramella": "- Alberto Ciaramella is an Italian computer engineer and scientist.\n- He obtained a Laurea in Electronic Engineering and the Post-Laurea in 1969 at La Sapienza University in Rome.\n- Ciaramella is notable for extensive pioneering contributions in the field of speech technologies and applied natural language processing.\n- He has published 40 papers and holds four patents.\n- Ciaramella worked at CSELT as a research engineer and co-authored some of the first international patents for speech recognition and speaker recognition.\n- He co-founded IntelliSemantic and continues research in applied language technologies.\n- In 2010 he co-authored a paper about the application of emerging \"semantic\" technologies to patent analysis.\n- Ciaramella participated in European projects focused on speech recognition and dialogue systems on many European languages, such as Italian.", "Alexander Dewdney": "- Alexander Keewatin Dewdney is a Canadian mathematician, computer scientist, author, filmmaker, and conspiracy theorist. \n- He was born in London, Ontario and is the son of Canadian artist and author Selwyn Dewdney.\n- He has made a number of experimental films including Malanga, Four Girls, Scissors, and the Maltese Cross Movement. He has also written two novels: The Planiverse and Hungry Hollow: The Story of a Natural Place.\n- Dewdney has written a number of books on mathematics, computing, and bad science and founded and edited a magazine on recreational programming called Algorithm. \n- He was a co-inventor of programming game Core War and has worked on biology as a field ecologist and mathematical biologist. \n- Dewdney is a member of the 9/11 truth movement and has theorized that the planes used in the September 11 attacks were flown by remote control.\n- He has published over 10 books on scientific possibilities and puzzles.", "Alexander Stepanov": "- Alexander Alexandrovich Stepanov is a Russian-American computer programmer.\n- He is an advocate of generic programming and is best known as the primary designer and implementer of the C++ Standard Template Library.\n- He started to develop the C++ Standard Template Library in 1992 while employed at HP Labs.\n- He convinced his colleagues at General Electric Research and Development to pursue generic programming and developed an Ada library for list processing in 1987.\n- He recognized that C++ was more likely to become widely used and provide good support for generic programming, leading to the development of the C++ Standard Template Library.\n- He is also the author of two books, Elements of Programming (with Paul McJones) and From Mathematics to Generic Programming (with Daniel E. Rose).\n- He retired from A9.com in January 2016.", "Alfred Aho": "\n\n- Alfred Vaino Aho is a Canadian computer scientist.\n- He is best known for his work on programming languages, compilers, and related algorithms, and his textbooks on the art and science of computer programming.\n- Aho was elected into the National Academy of Engineering in 1999 for his contributions to the fields of algorithms and programming tools.\n- He and his long-time collaborator Jeffrey Ullman are the recipients of the 2020 Turing Award, generally recognized as the highest distinction in computer science.\n- He received a B.A.Sc., M.A., and Ph.D. in Engineering Physics, Electrical Engineering/Computer Science from the University of Toronto and Princeton University.\n- Aho conducted research at Bell Labs from 1967 to 1991, and again from 1997 to 2002 as Vice President of the Computing Sciences Research Center.\n- Since 1995, he has held the Lawrence Gussman Professorship in Computer Science at Columbia University, where he has also served as the department chair.\n- Aho is widely known for his co-authorship of the AWK programming language with Peter J. Weinberger and Brian Kernighan.\n- He has authored or co-authored many textbooks, including the famous \"dragon books\" on compiler design.\n- Aho has received many prestigious honors, including the IEEE's John von Neumann Medal and membership in the National Academy of Engineering.", "Alston Householder": "- Alston Scott Householder is an American mathematician.\n- He specialized in mathematical biology and numerical analysis.\n- He invented the Householder transformation and Householder's method.\n- Householder received a PhD from the University of Chicago in 1937 for his thesis on the calculus of variations.\n- He worked on mathematical biology with Nicolas Rashevsky at the University of Chicago, then shifted to numerical analysis while at Oak Ridge National Laboratory.\n- Householder contributed to the organisation of research, serving as president of the Society for Industrial and Applied Mathematics.\n- He was married twice and had two children.\n- Some of his selected works include \"Discussion of a set of points in terms of their mutual distances\", a pioneer paper in multidimensional scaling, and \"The theory of matrices in numerical analysis\".\n- Householder died in Malibu, California in 1993."}